{
  "sessions": [
    {
      "Name": "Marcie Smith",
      "Vendor": "No",
      "Organization": null,
      "Organization website": null,
      "Linkedin ": null,
      "Twitter": null,
      "Facebook": null,
      "Job title": "Director, National Program",
      "Employer": "Intercambio Uniting Communities",
      "Co-leaders": "Debbie Goldman",
      "Title": "In Your Student's Shoes: Exploring Best Techniques for Teaching Adult ESL",
      "Objectives": "This workshop will simulate what it’s like to be an adult student learning a new language and provide modeling and practice for the teaching techniques that drive learning and change outcomes. The second half of this workshop will focus in on four keys of success in teaching Adult ESL: Keeping things simple; using intentional repetition; building classic engagement techniques; and approaching lessons with strategic planning and pacing. Attendees will leave with a firsthand experience of which tools and techniques feel most useful as an adult language learner.",
      "Target audience ": "Students, Faculty, Admin, Partners",
      "Session abstract": "As teachers, it is important to relate to students’ experience. Why are some approaches more helpful than others in language learning? This interactive workshop introduces effective key teaching techniques for adult ESL students, delivered partially as a foreign language lesson to give teachers a firsthand experience as the language learner. Attendees will be deeply involved in this workshop, beginning with a foreign language lesson where participants will be the students. They will experience first-hand which engagement techniques helped them most in acquiring the new language. The second half of this workshop will focus in on four keys of success in teaching Adult ESL: Keeping things simple; using intentional repetition; building classic engagement techniques; and approaching lessons with strategic planning and pacing. Attendees will leave with a firsthand experience of which tools and techniques feel most useful as an adult language learner. Expanding in this firsthand understanding, this workshop will help participants enhance their teaching with practical techniques and tools that raise the energy and build confidence in the classroom.",
      "Session strand": "Best Practices"
    },
    {
      "Name": "Marcie Smith",
      "Vendor": "No",
      "Organization": null,
      "Organization website": null,
      "Linkedin ": null,
      "Twitter": null,
      "Facebook": null,
      "Job title": "Director, National Program",
      "Employer": "Intercambio Uniting Communities",
      "Co-leaders": "Debbie Goldman",
      "Title": "Pronunciation in Adult ELL",
      "Objectives": "-Participants will learn key techniques for teaching and correcting pronunciation \n-Participants will learn to assess and teach sounds using certified resources\n-Participants will learn to utilize key pronunciation tools in context",
      "Target audience ": "Students, Faculty, Admin, Partners",
      "Session abstract": "A primary reason adult students pursue English language classes is to improve their pronunciation so that they can be understood. Acquiring pronunciation accuracy is key to adult English language learning success, and a crucial step for students to feel more connected and confident. This workshop provides teachers with practical, easy-to-use tools and techniques to deliver on what adult ESL students want most: to speak English well. By addressing students’ desire to learn correct pronunciation, teachers will also build their confidence, rapport, retention and participation in classrooms. \nThis workshop will focus on two recognized resources for teaching pronunciation: The Color Vowel™ Chart, and Intercambio’s Pronunciation Fun with Pictures. Specific techniques for incorporating pronunciation in lessons, catching trouble areas and correcting them, and using every-day tools for best outcomes, will highlighted. This is a great workshop for both beginner teachers and experienced/certified teachers. This is a fun and engaging session that provides practical teaching ideas that participants can quickly adopt and apply to their next class!",
      "Session strand": "Best Practices"
    },
    {
      "Name": "Marcie Smith",
      "Vendor": "No",
      "Organization": null,
      "Organization website": null,
      "Linkedin ": null,
      "Twitter": null,
      "Facebook": null,
      "Job title": "Director, National Program",
      "Employer": "Intercambio Uniting Communities",
      "Co-leaders": "Debbie Goldman",
      "Title": "Total Physical Response (TPR) for Beginning Levels in Adult ESL",
      "Objectives": "-Participants will learn basics of the TPR learning theory and approach \n-Participants will learn to utilize TPR in their context for best outcomes\n-Participants will be able to recognize and implement activities that increase movement",
      "Target audience ": "Students, Faculty, Admin, Partners",
      "Session abstract": "Most adult ESL students have varying levels of self-esteem and stress when it comes to learning English. Many work multiple jobs and are tired in class. When practicing TPR – Total Physical Response in the classroom, students have the opportunity to go from basic repetition and practice to fun, engaging learning tools that further cement their acquisition of the English language, and build  confidence. Teachers can significantly improve their classroom dynamic and raise the energy level. This workshop will be highly interactive! Participants will experience this technique as their students will: with lots of movement and collaborative techniques. The focus of this workshop is primarily on lower levels, though expansions for higher levels will be discussed as well. Participants will learn the background of TPR as a theory, and where to implement this engaging approach with hands-on tips and techniques. In addition, participants will learn how to recognize embedded activities with TPR and how to expand activities in any curriculum to increase movement and fun. The aim of this workshop is to get teachers confident and ready to implement TPR in their context.",
      "Session strand": "Best Practices"
    },
    {
      "Name": "Kathleen Mitchell",
      "Vendor": "No",
      "Organization": null,
      "Organization website": null,
      "Linkedin ": null,
      "Twitter": null,
      "Facebook": null,
      "Job title": "Instructor & Reading/Writing Coordinator ",
      "Employer": "University of Colorado Boulder's International English Center",
      "Co-leaders": "Matthew Burrows",
      "Title": "Academic Reading Instruction: A Grant-Funded Project Leveraging Authentic Open Materials",
      "Objectives": "Participants will learn about specific information on open licensing, strategies for adapting and publishing open educational resources (OER), and the details of a new OER advanced reading curriculum. ",
      "Target audience ": "Faculty, Admin",
      "Session abstract": "This session will explore a new advanced academic reading curriculum where students engage with adapted chapters from university freshman-level textbooks and build critical thinking, reading comprehension, and vocabulary skills. Attendees will learn how to pilot these free materials in their classrooms and preview some of the activities.  \n",
      "Session strand": "Best Practices, College & Career Transitions, Diverse Learners- including corrections, substance abuse, trauma survivors, etc."
    },
    {
      "Name": "Dan Griffith",
      "Vendor": "Yes",
      "Organization": "Essential Education",
      "Organization website": "https://essentialed.com/educators",
      "Linkedin ": null,
      "Twitter": null,
      "Facebook": null,
      "Job title": "National Manager",
      "Employer": "Essential Education",
      "Co-leaders": "None",
      "Title": "Survey Says...",
      "Objectives": "Participants will learn how Essential Education's HSE and ABE programs can impact student outcomes through engaging instruction, adaptive learning and exceptional diagnostics in both print, offline and online materials. Take-aways include:\n- Understanding how the adaptive learning engine creates customized learning plans for students\n- Learning ways to integrate print materials into a blended learning curriculum\n- Finding ways to use diagnostic reporting tools to maximize one-on-one time with students",
      "Target audience ": "Faculty, Admin",
      "Session abstract": "Participants will learn how Essential Education's HSE and ABE programs can impact student outcomes through engaging instruction, adaptive learning and exceptional diagnostics in both print, offline and online materials.",
      "Session strand": "Best Practices, Evidence & Research to Practice, Vendor/Business"
    },
    {
      "Name": "Dan Griffith",
      "Vendor": "No",
      "Organization": null,
      "Organization website": null,
      "Linkedin ": null,
      "Twitter": null,
      "Facebook": null,
      "Job title": "National Manager",
      "Employer": "Essential Education",
      "Co-leaders": "None",
      "Title": "Laughing for Learning: The Power of Humor in Adult Education",
      "Objectives": "Participants will learn how humor can be integrated mindfully into learning. This approach creates opportunities for more engaging instruction. Take-aways include:\n- Learning the structure of good humor\n- Planning for critical analysis of humor in the classroom\n- Understanding what is and is not appropriate\n- Content-specific tools for using humor",
      "Target audience ": "Faculty, Admin",
      "Session abstract": "The science behind laughter as a part of learning is fascinating! We simply need laughter as human beings and that applies in our classrooms as well as our family rooms. In adult education classrooms, humor relieves stress, breaks down cultural barriers and provides hope and joy. At the same time, we must be careful where we draw the line to avoid misunderstandings, hurt feelings or humor that borders the inappropriate. This session will look at the research behind humor in the classroom, how to intentionally plan for humor in your lessons, and the guidelines in adult education classrooms. Hopefully you will also get a good laugh or two! ",
      "Session strand": "Best Practices, Low Literacy Levels- including ELA and ABE"
    },
    {
      "Name": "Adam Springwater",
      "Vendor": "Yes",
      "Organization": "ETS HiSET Program",
      "Organization website": "https://hiset.ets.org/",
      "Linkedin ": "N/A",
      "Twitter": "https://twitter.com/HiSET_ETS",
      "Facebook": "https://www.facebook.com/ETSHiSET",
      "Job title": "Senior Manager, ETS HiSET Program",
      "Employer": "Educational Testing Service (ETS)",
      "Co-leaders": "N/A",
      "Title": "Math and Language Arts Readiness for the ETS HiSET Exam: Instructional Strategies and Tips to Engage and Motivate!",
      "Objectives": "Interactive workshop on core Math and Language Arts standards - how they are assessed on the ETS HiSET exam along with strategies for improving test taker pass rates.",
      "Target audience ": "Students, Faculty",
      "Session abstract": "A practical hands on workshop for Math and Language Arts. We will look at the Math and Language Arts College and Career (CCR) standards and how they are assessed for HSE, with particular attention to the most challenging test subjects: Algebra, Writing, and Reading Comprehension. Using actual test examples we will review and examine the most challenging and often failed test topics such as linear algebra, reading comprehension, and writing fluency. Participants will have hands on practice with specific tips and strategies for preparing students to take and pass the HiSET…the first time! This is a “tools you can use” audience participation session with practical examples and strategies for improving test taker pass rates.",
      "Session strand": "Diverse Learners- including corrections, substance abuse, trauma survivors, etc., Low Literacy Levels- including ELA and ABE, Vendor/Business"
    },
    {
      "Name": "Irene O'Brien",
      "Vendor": "No",
      "Organization": null,
      "Organization website": null,
      "Linkedin ": null,
      "Twitter": null,
      "Facebook": null,
      "Job title": "Instructor, Program Director",
      "Employer": "Community College of Aurora",
      "Co-leaders": "Jackie Zvejnieks",
      "Title": "The Journey from Permanent Resident to U.S. Citizen: Understanding the Process and Succeeding in the Interview",
      "Objectives": "Attendees will learn about the path of preparation to succeed in passing the test and interview. They will also learn about the parts of the tests: knowledge of the application and the civics test of 100 questions. Materials will also be shared with attendees.",
      "Target audience ": "Students, Faculty, Admin",
      "Session abstract": "This presentation is for teachers and administrators who: a) are interested in creating a U.S. Citizenship class, b) already offer citizenship classes, or c) incorporate citizenship instruction into their ESL classes. It is also for permanent residents interested in obtaining U.S. Citizenship. The presenters will discuss how to create and implement a U.S. Citizenship class based on personal experience at the Community ESL Program at the Community College of Aurora. Participants will learn about the components of the citizenship application process, materials available from USCIS and other sources which have been successful in our classes, and activities that prepare students to pass the test and interview. The presenters will also share some common student misconceptions about the citizenship process and how best to help students overcome barriers to success. If time permits, there will also be a mock interview.",
      "Session strand": "Best Practices, Diverse Learners- including corrections, substance abuse, trauma survivors, etc."
    },
    {
      "Name": "Nadine M. Kerstetter, M.Ed",
      "Vendor": "No",
      "Organization": null,
      "Organization website": null,
      "Linkedin ": null,
      "Twitter": null,
      "Facebook": null,
      "Job title": "GED and CTE Teacher",
      "Employer": "Colorado Department of Corrections",
      "Co-leaders": "n/a",
      "Title": "Adult Learners Struggle with Childhood LD",
      "Objectives": "1. Acquirer a better understanding of struggling students and justice involved defendants\n2. Foster a desire to continue to learn and advocate for special education for adult learners\n3. Start a conversation and create a peer network with contact information in order to do so.\n",
      "Target audience ": "Students, Faculty, Admin, Partners",
      "Session abstract": "The session will begin with a lecture consisting of notable quotes and summaries from published cases regarding adult students and justice involved defendants struggling with learning disabilities. \n\nA review of Lynda A. Price and Stan F. Shaw's publication on teaching adults with learning disabilities using andragogical practices will be presented, and participants of the workshop will be asked to contribute to a whole group discussion on the topic.\n\nThe lecture will resume with published definitions of learning disabilities in general, and two conditions in particular: Significant Identifiable Emotional Disability and  Attention Deficit Disorder. Participants are asked to discuss their experiences in table groups and prepare to share with the room.\n\nFor the most part, experienced educators in the session will be asked to impart knowledge.  The objective of this workshop is to start a conversation and create a peer network with contact information in order to do so.\n\n",
      "Session strand": "Best Practices, Diverse Learners- including corrections, substance abuse, trauma survivors, etc., Peer Networking"
    },
    {
      "Name": "Stevie Noll",
      "Vendor": "No",
      "Organization": null,
      "Organization website": null,
      "Linkedin ": null,
      "Twitter": null,
      "Facebook": null,
      "Job title": "Director of Training & Education",
      "Employer": "CWEE",
      "Co-leaders": "Isabel Cruz",
      "Title": "Nurturing Leaders, Nurturing Learners",
      "Objectives": "1.\tRedefine “leadership” and delve into a different approach to leadership development that is more accessible and relevant to a wide range of learners and their goals. \n2.\tGain a better understanding of how asset-based, culturally responsive leadership development can improve educational and professional outcomes for diverse adult learners. \n3.\tExplore best practices in implementing leadership development curriculum in workforce development settings and beyond. \n",
      "Target audience ": "Students, Faculty, Partners",
      "Session abstract": "Are you passionate about supporting your students to develop their voice and gain critical thinking and communication skills to be successful in their personal and professional lives? Join us for this session to discuss how integrating leadership development into your adult education curriculum can support students in achieving success as learners and career seekers. Using key principles of andragogy and workforce development, together we will explore how asset-based leadership curriculum and opportunities for practice can help nurture confidence, critical thinking, communication skills, and community involvement among learners of different backgrounds and identities. Our session will include examples of what transformative leadership development can look like in practice using our model and experiences at CWEE, a Denver-based workforce development nonprofit. And we will have an opportunity to engage in interactive activities as a group so you can see what integrating leadership development into your work could look like for your organization. ",
      "Session strand": "Diverse Learners- including corrections, substance abuse, trauma survivors, etc., Students and Young Ambassadors, Workforce Development"
    },
    {
      "Name": "Meredith Jones",
      "Vendor": "No",
      "Organization": null,
      "Organization website": null,
      "Linkedin ": null,
      "Twitter": null,
      "Facebook": null,
      "Job title": "Manager of Training and Education ",
      "Employer": "Center for Work Education and Employment",
      "Co-leaders": "None",
      "Title": "Drawing Your Way to Stronger Teaching",
      "Objectives": "•\tDiscuss research showing drawing pictures during a lesson helps students learn\n•\tLearn techniques for incorporating drawings into lessons\n•\tBrainstorm ideas for adding drawing into your specific lesson – even if you think you can’t draw!\n",
      "Target audience ": "Faculty",
      "Session abstract": "They say a picture is worth 1000 words. Complex ideas can often be more easily accessed, understood, and remembered if they are presented along with symbols and pictures. In this engaging session, adult educator Meredith Jones will discuss research showing that incorporating drawings into lessons can help learners of all ages and will share concrete ideas for adding drawings into your learning modules. The session will finish with some time to work on one of your own lessons and practice unleashing the burgeoning artist-teacher within you. Stick figures welcome! ",
      "Session strand": "Diverse Learners- including corrections, substance abuse, trauma survivors, etc., Low Literacy Levels- including ELA and ABE"
    },
    {
      "Name": "Liz Lanphear",
      "Vendor": "Yes",
      "Organization": "GED Testing Service",
      "Organization website": "http://www.ged.com",
      "Linkedin ": "https://www.linkedin.com/company/ged-testing-service/",
      "Twitter": "@GEDTesting",
      "Facebook": "www.facebook.com/GEDTesting/",
      "Job title": "State Relationship Manager",
      "Employer": "GED Testing Service",
      "Co-leaders": "none",
      "Title": "The 3 R's of GED Prep: Recruiting, Retention, & Results",
      "Objectives": "Learn to use free tools and resources to Recruit & Retain students and to improve pass rates on the GED exam",
      "Target audience ": "Faculty, Admin",
      "Session abstract": "This session is an overview of the tools available to assist you in recruiting, retaining, and honing the skills needed to pass the GED exam (results). ",
      "Session strand": "Best Practices, Vendor/Business"
    },
    {
      "Name": "Allie",
      "Vendor": "No",
      "Organization": null,
      "Organization website": null,
      "Linkedin ": null,
      "Twitter": null,
      "Facebook": null,
      "Job title": "Program Coordinator",
      "Employer": "Spring Institute for Intercultural Learning",
      "Co-leaders": "n/a",
      "Title": "Looking Ahead for the Next Step",
      "Objectives": "After the session, participants will be able to utilize a variety of navigational tools that support learners of all backgrounds, determine ways their program is already supporting students through navigation effectively, and identify one way to improve their program’s navigational structure through the tools and strategies discussed during the presentation.\n",
      "Target audience ": "Faculty, Admin",
      "Session abstract": "Often navigational efforts with students seem to require so much time and energy with little chance of a true connection being made. How can we improve our program’s navigational efforts to support student goals? How can we bridge those connections to maintain lasting partnerships? And how do we keep in touch with our students to track outcomes after they have moved onto a new training or program? In this session we will dive into various practical navigational strategies, such as utilizing G-Suite tools, to record program-supporting data and analyze navigational efforts from intake to program completion. Participants will leave with practical navigational tools to serve their program in creative ways to track data and prove student outcomes.\n",
      "Session strand": "College & Career Transitions, Navigation/Career Coaching"
    },
    {
      "Name": "Martin Loa",
      "Vendor": "Yes",
      "Organization": "Burlington English",
      "Organization website": "http://www.burlingtonenglish.com",
      "Linkedin ": null,
      "Twitter": null,
      "Facebook": null,
      "Job title": "Customer Specialist",
      "Employer": "BurlingtonEnglish",
      "Co-leaders": "Martin Loa",
      "Title": "Reaching Targeted Results Made Easy using CASAS & BurlingtonEnglish",
      "Objectives": "Participants will learn about all of the components of the Burlington English Prepare for CASAS system as well as how to access it on multiple devices that your teachers and students have access to in the classroom or at home.",
      "Target audience ": "Faculty, Admin, Partners",
      "Session abstract": "Get on-target results with CASAS assessments and resources!  Come join our session and learn how easy to use and time saving the CASAS assessments are, and explore ways that BurlingtonEnglish can help prepare your students!!  Using the CASAS assessments allows you to measure skills and report progress easily and effectively. Tests include real-life skills and competencies and are easy to administer to provide you with immediate results.  Participants will learn about all of the components of the Burlington English Prepare for CASAS system as well as how to access it on multiple devices that your teachers and students have access to in the classroom or at home.  Teachers have access to comprehensive Prepare for CASAS In-Class Lessons for whole class activities and students have additional lessons that can be accessed immediately on a separate device.  Don’t let limited computer lab access limit your students’ use of technology in the classroom! ",
      "Session strand": "Evidence & Research to Practice, Low Literacy Levels- including ELA and ABE, Vendor/Business"
    },
    {
      "Name": "Talya Clay",
      "Vendor": "Yes",
      "Organization": "National Geographic Learning",
      "Organization website": "https://eltngl.com/",
      "Linkedin ": "http://www.linkedin.com/company/eltngl",
      "Twitter": null,
      "Facebook": "https://www.facebook.com/ELTNGLUSCanada/",
      "Job title": "SENIOR EDUCATIONAL SALES CONSULTANT Adult and Academic ESL",
      "Employer": "National Geographic Learning",
      "Co-leaders": "NA",
      "Title": "Boost Reading and Writing Skills for Adult ESL",
      "Objectives": "•\tDiscuss relevant skills that help adult ESL learners be prepared for careers and post-secondary education. \n•\tPresent instructional reading materials from National Geographic Learning that provide adult learners with essential reading, academic and critical thinking skills: skimming, scanning, summarizing, inferring, categorizing, identifying main idea and vocabulary development.\n•\tPresent instructional writing materials from National Geographic Learning that will help adult learners become confident writers through clear explanations, academic writing models and extensive practice.\n",
      "Target audience ": "Faculty",
      "Session abstract": "As most adult education programs seek to address the urgent need for equity, access, and rigor for adult ESL, the need for explicit reading and writing instruction has become critical.  National Geographic Learning utilizes authentic and responsive content to help adult ESL learners achieve their language goals. This session will focus on these critical areas, developing reading and writing for ESL.",
      "Session strand": "Vendor/Business"
    },
    {
      "Name": "Adam Springwater",
      "Vendor": "Yes",
      "Organization": "ETS HiSET",
      "Organization website": "https://hiset.ets.org/",
      "Linkedin ": "Adam Springwater",
      "Twitter": null,
      "Facebook": "HiSET",
      "Job title": "Client Relations Manager ",
      "Employer": "Education Testing Service ",
      "Co-leaders": "none ",
      "Title": "HSE Languange Arts  Writing Workshop! Test Tips and Strategies ",
      "Objectives": "Participants will get a detailed overview of the subtest including CCR standards, DOK levels, and Content Categories\nParticipants will practice specific instructional strategies, tips, and insights to improve Test Taker readiness\nLesson Plans and Activities as well as test item samples will be provided",
      "Target audience ": "Students, Faculty",
      "Session abstract": "Take a close look at the HiSET Language Arts Writing subtest, the key CCRS standards that are assessed, and how they are tested. Combining these insights, we will demonstrate practical tools and lesson planning strategies that best help prepare test takers to take and pass the HiSET…the first time!",
      "Session strand": "Best Practices, Low Literacy Levels- including ELA and ABE"
    },
    {
      "Name": "A Yvette Myrick",
      "Vendor": "No",
      "Organization": null,
      "Organization website": null,
      "Linkedin ": null,
      "Twitter": null,
      "Facebook": null,
      "Job title": "Dean, School of Transitional Education",
      "Employer": "Colorado Mountain College",
      "Co-leaders": "Tiffany Pippin, Anne Petti",
      "Title": "Empowering Adult Learners to be Ambassadors: Lessons Learned",
      "Objectives": "Attendees will feel prepared to implement a Student Ambassador Training at their local level.  Attendees will understand what a Student Ambassador does.  Attendees will have strategies for identifying Student Ambassadors.",
      "Target audience ": "Students, Faculty, Admin, Partners",
      "Session abstract": "What is the Student Ambassador Program, and is it the right fit for your learners?  Three Colorado Adult Education programs will hold a panel discussion to describe lessons learned about implementing this train-the-trainer student leadership and advocacy training.  Participants will leave feeling equipped to engage in a training at their local level and will also benefit from the opportunities and challenges explained by the panel.",
      "Session strand": "Best Practices, Students and Young Ambassadors, Advocacy"
    },
    {
      "Name": "Mathew Mengesha ",
      "Vendor": "No",
      "Organization": null,
      "Organization website": null,
      "Linkedin ": null,
      "Twitter": null,
      "Facebook": null,
      "Job title": "Policy Advocate",
      "Employer": "Spring Institute",
      "Co-leaders": " Tiffany Pippin",
      "Title": "Adult Education Advocacy ",
      "Objectives": "1. Advocacy 101 training  and brainstorming for adult education.\n2. Resources for advocacy.\n3. A coalition/ network of adult education providers and supporters for advocacy ",
      "Target audience ": "Students, Faculty, Admin, Partners",
      "Session abstract": "An overview and brainstorm session of advocacy strategies for adult education providers and supports to push for more access and funding. We would like to begin the conversation around what the needs are for adult education and build working groups to initiate more advocacy at the State Legislature. ",
      "Session strand": "Advocacy "
    },
    {
      "Name": "Christina Miller",
      "Vendor": "No",
      "Organization": null,
      "Organization website": null,
      "Linkedin ": null,
      "Twitter": null,
      "Facebook": null,
      "Job title": "Consultant",
      "Employer": "Paxen Steck Vaughn",
      "Co-leaders": "Christina Miller",
      "Title": "Building Pathways for Your Students’ Success",
      "Objectives": "1) Participants will have a clear understanding of comprehensive Career Pathway programs that meet the needs of local employers and industry-focused sectors including two templates to use.\n2) Participants will learn how adult education programs can partner with employers to develop meaningful curriculum, develop workforce awareness activities and use Labor Market Information (LMI) to cooperatively translate workplace skills into learning objectives.  \n3) Participants will learn about the components of Integrated Educational Training (IET) programs that contribute to successful programs. ",
      "Target audience ": "Faculty, Admin, Partners",
      "Session abstract": "  This session will explore the numerous ways Career Pathways can be designed and implemented to comply with WIOA regulations.  The components of Integrated Educational Training (IET) programs that contribute to successful programs will be discussed including understanding Employer Measures and using Labor Market Information (LMI) to build - or enhance - your Career Pathways program.\n   We will discuss various frameworks and specifically, a six-point framework, that can be offered by local programs with templates available for use.  The framework will identify well-planned, comprehensive Career Pathway programs that meet the needs of local employers and industry-focused sectors.  We will explore how adult education programs can partner with employers to develop meaningful curriculum, develop workforce awareness activities and use Labor Market Information (LMI) to cooperatively translate workplace skills into learning objectives.  \n",
      "Session strand": "College & Career Transitions, Workforce Development"
    },
    {
      "Name": "Christina Miller",
      "Vendor": "Yes",
      "Organization": "Paxen Steck Vaughn",
      "Organization website": "https://www.paxenpublishing.com",
      "Linkedin ": null,
      "Twitter": null,
      "Facebook": null,
      "Job title": "Consultant",
      "Employer": "self-employed",
      "Co-leaders": "Christina Miller",
      "Title": "Understanding TABE 11/12 to Make Those Level-to-level NRS Gains!\t",
      "Objectives": "1) This session will analyze how the AE-College and Career Readiness Standards (AE-CCRS) were used to build TABE 11/12. \n2) Participants will be guided through an analysis of a completed TABE 11/12 Student Profile Report and and follow the results through a breakdown of what skills are needed to move from non- or partial proficiency to complete proficiency on the post-test.  \n3) Participants will have a better understanding of how assessment guides instruction.",
      "Target audience ": "Faculty, Admin",
      "Session abstract": "This session will analyze how the Adult Education-College and Career Readiness Standards (AE-CCRS) were used to build TABE 11/12 and how the AE-CCRS translate into classroom instruction to achieve positive outcomes.  We will analyze the AE-CCRS domains and follow the results of a completed TABE 11/12 through the breakdown of the TABE Associated Skills needed to move students from non- or partial proficiency to complete proficiency on the posttest.    Attendees will learn how to target the skills needed to make the NRS level to level gains that are critical for performance-based funding. We will briefly review Paxen Steck Vaughn's answer to the TABE 11/12 challenges – TABE Tutor series and the associated companion resources.",
      "Session strand": "Vendor/Business, This session focuses on TABE 11/12 and assessment strategies that help teachers achieve post-test gains.  The presentation very briefly mentions any product from the vendor.   "
    },
    {
      "Name": "Karyn Light-Gibson",
      "Vendor": "No",
      "Organization": null,
      "Organization website": null,
      "Linkedin ": null,
      "Twitter": null,
      "Facebook": null,
      "Job title": "Adult Educator Lead Instructor",
      "Employer": "Spring Institute for Intercultural Learning",
      "Co-leaders": "NA",
      "Title": "Teacher Observations: A Guide to Practical and Productive Collaborations",
      "Objectives": "1) Review research on providing feedback to instructors/peers\n2) Reflect on personal observations and teaching experience, as well as how you or others have used (or not used) thoughtful feedback\n3) Use research findings and personal experiences  to create collaborations with instructors that incorporate feedback and improve overall classroom experience",
      "Target audience ": "Faculty, Admin",
      "Session abstract": "Regular feedback is essential to the growth of instructors, from those just beginning to those who have been teaching for decades. However, when peers or administrators observe, the post-class discussion is not always fruitful. Why may that be? In this session, I will present other’s research on feedback (Martinez et al. 2016; Archer et al. 2016). We will use that knowledge to reflect on our own experiences as the observer  providing feedback. Finally, we will discuss ways to ensure teachers find the information useful and are able to implement beneficial changes. Every teacher is different and requires various levels of support. This workshop will help you effectively communicate your feedback to all teachers and peers. ",
      "Session strand": "Evidence & Research to Practice"
    },
    {
      "Name": "Tadd Wamester",
      "Vendor": "Yes",
      "Organization": "Voxy ",
      "Organization website": "https://voxy.com/solutions/new-americans/",
      "Linkedin ": "https://www.linkedin.com/company/voxy/",
      "Twitter": "Voxy",
      "Facebook": null,
      "Job title": "Director, New Americans",
      "Employer": "Voxy",
      "Co-leaders": "Ken Barr",
      "Title": "Career Pathways for English Language Learners",
      "Objectives": "Session participants will:\n1) understand how to serve the needs of diverse ELLs and personalize the learning to their specific goals and proficiency level\n2) create talent pools for workforce development and understand how to partner with workforce development organizations and employers\n3) learn new strategies for how to blend learning for optimal outcomes and increase graduation rates by adding more flexible learning options\n\n",
      "Target audience ": "Faculty, Admin, Partners",
      "Session abstract": "English language learners need personalized, flexible instruction in order to connect with career pathways and employment opportunities. Learn about how Voxy and ProLiteracy/New Readers Press have partnered to break down barriers to employment for English language learners of various levels. We will share best practices to build effecting blended, mobile learning programs that enhance your region's talent pipelines while helping students connect with in-demand career pathways. Learn about employer-sponsored and informed models for training English language learning to the jobs of the future. This session will include best practices for taking new programs to scale and accelerating proficiency gains in learners than align with employer expectations.",
      "Session strand": "Best Practices, College & Career Transitions, Workforce Development"
    },
    {
      "Name": "Miriam Goldberg",
      "Vendor": "No",
      "Organization": null,
      "Organization website": null,
      "Linkedin ": null,
      "Twitter": null,
      "Facebook": null,
      "Job title": "Chief Education Officer",
      "Employer": "CSMlearn",
      "Co-leaders": "NONE",
      "Title": "CSM: Remediation, Self-confidence, College Credit, and Employability Skills",
      "Objectives": "1.\tHow the CSM Course personalizes instruction for all learners, even those with low skills and developing English, and builds self-confidence\n2.\tHow the CSM Certificate gains college credit and shows employability skills \n3.\tHow to implement CSM by coaching students holistically with an emphasis on building learning effectiveness, positive learning behaviors, and self-efficacy.",
      "Target audience ": "Faculty, Admin, Partners",
      "Session abstract": "The CSM Course uses unique online personalized learning technology towards four goals:\n1)\tRemediation. The CSM Course adapts to every student’s knowledge, and can fill math and literacy gaps as low as 4th grade level. CSM keeps all students working at the level that is right for them, and is a good fit for mixed-level classes.\n2)\tSelf-Confidence. Many adult learners have had poor experiences with education in the past, and enter the classroom filled with fear of failure. CSM is designed to implicitly and explicitly help students realize that they are capable of doing challenging work, and have the skills that they need to succeed in the future.\n3)\tCollege Credit. CSM is accepted for college credit at colleges serving collectively over 300,000 undergraduates, and is an inexpensive and supportive transition to college. At many of these colleges, CSM fulfills the often-intimidating math requirement.\n4)\tEmployability Skills. CSM is broadly aligned with the Common Employability Skills framework, adopted by industry associations as the skills needed by all employees. CSM builds the skills of learning independently, attention-to-detail, and persistence through challenges. \n",
      "Session strand": "College & Career Transitions, Workforce Development, Vendor/Business"
    },
    {
      "Name": "Mike Johnson",
      "Vendor": "Yes",
      "Organization": "DRC - Data Recognition Corporation ",
      "Organization website": "https://www.datarecognitioncorp.com/",
      "Linkedin ": null,
      "Twitter": null,
      "Facebook": null,
      "Job title": "National Adult Education Director - TABE & TASC",
      "Employer": "DRC",
      "Co-leaders": "Christina Traudt",
      "Title": "TABE 11/12 Updates and Best Practices",
      "Objectives": "* Overview of the new TABE 11/12 test (only assessment fully approved under the new Federal NRS regulations covering Reading, Math and Language). \n* Newly reduced testing times and updated diagnostic reporting.  \n* Best practices for computer based testing\n* Scanning options\n* New data transfer options to reduce manual data entry after testing.",
      "Target audience ": "Faculty, Admin",
      "Session abstract": "TABE 11/12 Updates and Best Practices:\nThis session provides an overview of the new TABE 11/12 tests, the only assessment fully approved under the new Federal NRS regulations covering Reading, Math and Language. This overview describes the newly reduced testing times and updated diagnostic reporting.  We will also review best practices for computer based and paper based testing learned from other programs.   Participants will also learn about scanning options and new data transfer options to reduce manual data entry after testing.",
      "Session strand": "Best Practices, Diverse Learners- including corrections, substance abuse, trauma survivors, etc."
    }
  ],
  "vendors": [
    {
      "Organization": "National Geographic Learning",
      "Name": "Talya Clay",
      "Job title": "Senior Educational Sales Consultant",
      "Additional representatives": null,
      "Logo": "@natgeo.jpg",
      "Website": "https://eltngl.com/",
      "Linkedin": "http://www.linkedin.com/company/eltngl",
      "Twitter": null,
      "Facebook": "https://www.facebook.com/ELTNGLUSCanada/",
      "Description": "At National Geographic Learning, our goal is to bring the world to the classroom, and the classroom to life. We think the world is incredible, and that learning should inspire and amaze. We want students of English and their teachers to experience the excitement and joy of learning through our materials. With our English language programs, students learn about their world by experiencing it."
    },
    {
      "Organization": "ETS HiSET",
      "Name": "Adam Springwater",
      "Job title": "Senior Manager, ETS HiSET Program",
      "Additional representatives": null,
      "Logo": "@hiset_ets.jpg",
      "Website": "https://hiset.ets.org/",
      "Linkedin": null,
      "Twitter": "@HiSET_ETS",
      "Facebook": "https://www.facebook.com/ETSHiSET",
      "Description": "\nEducational Testing Service (ETS) broke new ground in adult education with the HiSET® exam — an affordable, accessible high school equivalency test option that was introduced in 2014. Built on the College and Career Readiness Standards, the HiSET exam gives out-of-school youth and adults an opportunity to demonstrate their skills and earn a state-issued high school equivalency credential. The exam features paper- and computer-based formats, in English and Spanish. Now the fastest-growing exam on the market it has been adopted in more than 28 states and territories."
    },
    {
      "Organization": "Literacy Coalition of Colorado",
      "Name": "Dorothea Steinke",
      "Job title": "board chair",
      "Additional representatives": "Cindy Welsh",
      "Logo": "@literacycc.jpg",
      "Website": "https://literacycolorado.org",
      "Linkedin": null,
      "Twitter": null,
      "Facebook": "https://www.facebook.com/Literacy-Coalition-of-Colorado-251935441595829/",
      "Description": "Our mission: Ensure that adult education is available to all who seek it. We do this by Advocating for adult education; Connecting students to  programs and programs to each other; and Training tutors and teachers. We ACT!"
    },
    {
      "Organization": "GED Testing Service ",
      "Name": "Liz Lanphear",
      "Job title": "State Relationship Manager ",
      "Additional representatives": null,
      "Logo": "@gedtesting.jpg",
      "Website": "http://www.ged.com",
      "Linkedin": null,
      "Twitter": null,
      "Facebook": null,
      "Description": "This will be sent in an email"
    },
    {
      "Organization": "Colorado Christian University ",
      "Name": "Brittany Miller",
      "Job title": "Strategic Partner Specialist",
      "Additional representatives": null,
      "Logo": "@ccu_cags.jpg",
      "Website": "https://www.ccu.edu/ccu/online/",
      "Linkedin": "https://www.linkedin.com/company/colorado-christian-university-college-of-adult-&-graduate-studies/about/",
      "Twitter": null,
      "Facebook": "https://www.facebook.com/online.ccu/",
      "Description": "For 100+ years, CCU has been educating Christian men and women, pursuing and refining our call to provide a quality education in a distinctly Christian environment. Our professors are mentors as well as teachers, as they integrate faith into our exemplary academic programs. And while you're in the classroom, you'll integrate dynamic learning with rock-solid faith, and begin to discern God's plan for your life. Faith and learning; at CCU, we prefer the combination. For more info go to online.ccu.edu. "
    },
    {
      "Organization": "Aztec Software",
      "Name": "Adriane Fajnor",
      "Job title": "VP Client Relations & Communications",
      "Additional representatives": "Tara Keily",
      "Logo": "@aztecsoftware.jpg",
      "Website": "http://www.aztecsoftware.com",
      "Linkedin": null,
      "Twitter": null,
      "Facebook": null,
      "Description": "Since its founding in 1980, Aztec Software has always been a pioneer using technology for adult learners with academic materials designed to develop educational excellence as well as building up soft, employability skills. These dynamic learning solutions effectively help to equip adults and non-traditional students with knowledge towards higher learning, exponentially improve career readiness and job performance, and ultimately help people realize their potential and achieve their goals. Aztec offers adult-based computer solutions in ABE, Pre-HSE, HSE and College/Career prep. And with the introduction of LIFE SKILLS EDUCATION to the Aztec Learning System, individuals can acquire skills to better navigate life’s challenges, strengthen their core problem-solving abilities, and successfully learn how to get hired and stay hired through these insightful career and personal development booklets. Resources available in both print and computer-based learning for ANYTIME, ANYWHERE and ANY DEVICE offerings."
    },
    {
      "Organization": "Paxen Publishing Steck Vaughn Adult Education",
      "Name": "Heather Morrison",
      "Job title": "Sr. Account Executive",
      "Additional representatives": null,
      "Logo": "@paxenpublishing.jpg",
      "Website": "https://www.paxenpublishing.com/",
      "Linkedin": null,
      "Twitter": null,
      "Facebook": null,
      "Description": "Paxen Publishing/Steck Vaughn Adult Education provides teachers and individuals with the tools they need to build lasting academic, employment and life skills."
    },
    {
      "Organization": "DRC - Data Recognition Corporation ",
      "Name": "Christina Traudt",
      "Job title": "Assessment Solution Representative ",
      "Additional representatives": null,
      "Logo": "@drceducation.jpg",
      "Website": "https://www.datarecognitioncorp.com/",
      "Linkedin": null,
      "Twitter": null,
      "Facebook": null,
      "Description": "TABE® remains the most comprehensive and reliable assessment product in the education industry, providing a solid foundation for effectively assessing the skills and knowledge of adult learners."
    },
    {
      "Organization": "New Readers Press",
      "Name": "Ken Barr",
      "Job title": "Sales Consultant",
      "Additional representatives": null,
      "Logo": "@newreaderspress.jpg",
      "Website": "http://www.newreaderspress.com",
      "Linkedin": null,
      "Twitter": null,
      "Facebook": null,
      "Description": "Adult learners need literacy materials designed with them in mind. For more than 40 years, New Readers Press (NRP), ProLiteracy's publishing division, has provided educators with the instructional tools to teach adult students the skills they need to thrive. From basic reading instruction to high school equivalency and workplace skills development, NRP provides close to 400 titles to help adult students confidently take the next step forward."
    },
    {
      "Organization": "Intercambio Uniting Communities",
      "Name": "Kira Ross",
      "Job title": "National Program Manager",
      "Additional representatives": "Krista Kennedy",
      "Logo": "@intercambio.png",
      "Website": "http://www.intercambio.org",
      "Linkedin": null,
      "Twitter": null,
      "Facebook": "https://www.facebook.com/IntercambioUC/",
      "Description": "We provide English language education, resources, and training that create meaningful connections, build cultural awareness, and inspire confidence. Our National Program works with over 600 organizations around the country, providing materials, fun and accessible online training, and day-to-day support. "
    },
    {
      "Organization": "Essential Education",
      "Name": "Dan Griffith",
      "Job title": "National Manager",
      "Additional representatives": "Alyssa Garcia",
      "Logo": "@essentialed.jpg",
      "Website": "https://essentialed.com",
      "Linkedin": null,
      "Twitter": null,
      "Facebook": null,
      "Description": "Provider of a full suite of adult learning materials with integrated print and digital solutions."
    }
  ]
}
