{
  "awards": [
    {
      "award": "Adult Education's Leader of the Year",
      "nominee": "Sarah Secrist",
      "nominator": "Susan Gong",
      "testimony": "Sarah Secrist is the Program Operations Manager for The Learning Source. She is a tireless proponent of adult education who is the center of operations within our organization. She works with our CEO and board of directors to ensure the vision for The Learning Source is being realized in our classrooms. Additionally, she works with program managers to oversee all our programs, which cover English Language Acquisition, High School Equivalency, and Family Literacy. Honestly, I can't keep track of everything that she does, but here are some of her accomplishments from the past year: she has updated our employee handbook, which contains all our standard forms and processes that are aligned with AEI policy; re-structured how we store and share files on OneDrive, which has made communication amongst our 25 locations much more efficient; organized our agency’s graduation ceremony; organized our yearly all-staff meeting and training, which was attended by about 75 staff, instructors, and volunteers; oversaw our transition to a new ESL curriculum and new TABE 11/12 assessments; and has worked to bring more technology into our classrooms. Most importantly, she has brought an incredible amount of energy and dedication to our organization and is an example to us all. She balances professionalism with warmth by setting monthly goals, meetings, and long-term expectations while also baking brownies and other treats for staff and relating to everyone on a personal level. She ties everything and everyone together. I have never had a better supervisor that can judge when to move fast and get things done and when to slow down and carefully consider all possibilities before acting. If anyone deserves this award, it is Sarah Secrist."
    },
    {
      "award": "Adult Education's Volunteer of the Year",
      "nominee": "Ron Hettinger",
      "nominator": "Janet Paulson",
      "testimony": "Ron Hettinger has volunteered as a Math tutor with CCA’s High School Equivalency program since its inception in 2014. Ron’s dedication to adult education spans many years as he worked with GED prep students at other adult education providers in Aurora for several years prior to CCA’s HSE program launch. \n\nRon works with groups of 6-10 students twice a week. He works with ABE-level Math students – helping them to prepare for the ASE-level Math class -- and ASE-level Math students to help them get ready for their HSE tests.\n\nOver the years, Ron has made a positive impact on hundreds of adult education students. One young man in particular struggled with his studies because of issues with short-term memory due to several strokes. It took him a couple of years, but he managed to complete his GED tests, with only Math left. He had an especially hard time with algebraic formulas. After requesting a Testing Accommodation for the GED Math test, and having it denied, he was ready to quit. This student has an artistic talent and Ron figured that he might be more successful with Geometry, given how all those angles and shapes relate to one another. Ron worked with this student – focusing on geometry and repetition. It took a few practice tests and another failed attempt at the real test, but this student finally passed his GED Math test and received his High School Equivalency credential. \n\nRon’s interest in his students reaches beyond mathematics. Many of his students are not native English speakers and need practice with reading. Ron encourages his students to read, read, read! He’s also recommended books to them and has even loaned out his own copies for their reading enjoyment. \n"
    },
    {
      "award": "Adult Educator of the Year",
      "nominee": "Haven Marsh",
      "nominator": "Margie Wagner",
      "testimony": "Haven has worked as an ABE/HSE instructor since 2010. She is a versatile instructor having taught classes in basic reading for adults reading below a 4th grade level, mid-level reading comprehension and language arts, top level HSE preparation, math, college prep English, and a mixed-level HSE prep course with free childcare for parents at an off-site location. At this site, she often handles intake and assessment duties for both HSE and ESL students in addition to teaching. Haven has always been willing to work nights and summers.\n\nHaven consistently participates in professional development opportunities and shares her knowledge with others. When the GED Exam was revised in 2014 and the HiSET and TASC were adopted in 2016, Haven attended any training provided, did her own research, and then shared her findings with her colleagues. She volunteered to participate in the CCRS Institute and took the lead on training the rest of the staff to adopt this new paradigm. In fall of 2015, I hired Haven as the Lead ABE/HSE Instructor; she has done a superb job of creating a high-functioning team. Haven also presented a popular workshop on teaching writing at a recent CAEPA conference.\n\nPerhaps Haven’s most outstanding quality is her dedication to students. She is a master teacher, creating interesting lessons and differentiating instruction to meet students’ learning needs. When a student is absent, she calls or texts to make sure all is well and encourage them to persist. She will come early, stay late, tutor, offer a ride, connect students to resources, or whatever it takes to help a student succeed. Several of Haven’s HSE graduates started as ESL students and worked over several years to pass the HSE Exam. It is a thrill to witness that kind of success!"
    },
    {
      "award": "Ann Deditz Scholarship",
      "nominee": "Diana Rangl",
      "nominator": "Self"
    },
    {
      "award": "Outstanding Organization in Supporting Adult Education",
      "nominee": "Cargill",
      "nominator": "George O'Clair",
      "testimony": "Cargill Meat Solutions knew that Workplace Education was important to the development and retention of their employees. Employees could attend classes before or after their shifts on site. Their employees had improved communication, safety, and attention to quality after attending Workplace Education. Cargill worked with the program director to discover ways to make up for the lack of federal funding. The program found a refugee grant and high school money, and Cargill decided to fund the rest. Cargill also expanded Workplace Education by offering the program to the public to sustain services that Morgan Community College could no longer offer to the community."
    }
  ],
  "keynotes": [
    {
      "name": "George O'Clair",
      "title": "President",
      "organization": "CAEPA President",
      "session": "Welcome Letter",
      "biography": "Welcome to the 2018 CAEPA Conference! Thank you for taking time from your busy schedule to learn, refresh, and connect with colleagues.\n\nI would like to describe an Adult Basic Education (ABE), Adult Secondary Education ASE), and High School Equivalency education (HSE) teacher and learner as being persistent, challenged, overwhelmed, and hopeful. In these shifting times of funding concerns, new partnerships, and direction of occupations, Adult Education does matter and can make a difference. The Adult Education students who are in the classroom today, will be making up the workforce demand tomorrow. We as Adult Educators are constantly challenged by multiple constraints including from your learners themselves. We may feel overwhelmed by the amount of work to be done and the effort it takes to keep going, nonetheless, we can see the long-term benefits by the stories of success. Finally, I ask you to remain hopeful in knowing that the steps you are taking along with your learners will make an impact in all our communities.\n\nWe are in a changing time in adult education that may make many wonder about our direction and purpose. I ask you to be brave, patient, and connected as we work together making changes we know will benefit our learners and all who come in contact with them.\n\nYou make the difference.\n\nThank you.\nGeorge O'Clair"
    },
    {
      "name": "Phil Covarrubias",
      "title": "State Representative",
      "organization": "Colorado House of Representatives",
      "session": "Tuesday, October 23, 2018 from 8:15 - 9:30",
      "biography": "I was born and raised in Arvada, CO. My father worked his way up from a field picker to a construction worker, having worked on building the Eisenhower tunnel and the mines in Idaho Springs. He eventually made his way to the Front Range where he worked in an electrical distribution plant. He taught me that I could achieve anything with hard-work and integrity - the same values that make the United States of America the greatest country in the world. I applied our American values to every aspect of my life. After graduating Arvada High School, I decided to defend our values and our Constitution by joining the Marine Corps. While in the Marines, I served as a combat engineer in South America. I earned the great honor of being a marksmanship instructor for all ranks of soldiers from new recruits to battalion commanders. Serving my country enabled me to see the needs and importance of all people, no matter their class, color or creed. I developed empathy and a desire to be a public servant when I witnessed the lack of rights and freedoms other countries struggled with firsthand. This made me appreciate how grateful I am for being born in the United States. After being honorably discharged from the Marines in 1990, I helped my father build his construction company, CCSI, which now competes for major projects across the Front Range. As a project manager and foreman, I spent many long hours on job sites from DIA to Rocky Flats and Peterson Airfield; putting the engineering and leadership skills I learned in the Marines to use. Life lead me to Xcel Energy, where I currently work as a foreman. Along with my role at Xcel I spend a lot of time giving back. I act as a veteran’s facilitator for newly discharged veterans. I help them acclimate from combat life to their professional lives. I also volunteer for Junior Achievement and am a part of the Xcel Energy Path to Leadership, which is a yearlong program that teaches upcoming leaders about the energy industry. I currently live in Brighton, Colorado with my two children, Nicholas, 13, and Erik, 11, where I served as a Commissioner on the Planning Commission since 2014. As I got older, I noticed that our country was losing the values of integrity and hard-work. Once the Democrats at the State Capitol slammed Bloomberg-sponsored gun laws and rural energy laws down Coloradans throats in 2013, I decided to get involved. I wanted my children to live in the America I once knew. In 2014, I joined the fight by working on former Congressman Tom Tancredo’s gubernatorial campaign. I helped connect Congressman Tancredo’s message of freedom and the American Dream to the Hispanic community. I am not a member of the political elite. I fought for liberty and the Constitution as a Marine, and my experience on the Tancredo campaign made me believe that I could do it again. I am representing Colorado House District 56 because I want my children to have the same opportunities America provided me. I believe in a government of the people, by the people, and for the people. My next work as a public servant will be to work for our community as your Representative. The best type of leader is the one who is willing to pick up a shovel alongside his employees to get the job done. I can be that leader. I will do everything in my power to restore integrity, hard work, and the American Dream.."
    },
    {
      "name": "Retired Colonel Baerbel Merrill",
      "title": "MS, BSN, RN.C, CIC",
      "session": "Tuesday, October 23, 2018 from 8:15 - 9:30",
      "biography": "Baerbel Merrill was born in Germany. She grew up in Berlin, a divided city. Her first exposure to a foreign language was in fifth grade, when the school taught English. In seventh grade, she learned French, and then she chose to learn Latin in ninth grade. English and French were mandatory. When Merrill immigrated to the United States, her English was very British English. Once in the U.S. Merrill had the opportunity to take an English course taught by a retired school teacher in her home. Merrill attended class two evenings every week for six months.\n\nIn the late 1960’s a vocational/technical junior college was built in her town. Meanwhile, Merrill had different jobs. One was working the night shift at Sylvania on an assembly line making “diodes”. Another was sewing labels on clothing at the Woven Label Company. She wanted a better job, so she would visit the local employment office to see if anything else was available. One day Ted, from the local employment office, said to her, “Have I got a deal for you! How would you like to go to the junior college to become a licensed practical nurse?” The program would pay for everything, including schooling, housing, and food. This was important because Merrill was raising four children on her own. That was the start of her nursing career. Merrill loved school and learning new things. Even though her English was adequate, she continued to take English classes throughout nursing school.\n"
    },
    {
      "name": "Rachel Brownlee",
      "title": "Director - Human Resources",
      "organization": "Cargill",
      "session": "Tuesday, October 23, 2018 from 11:45 - 1:00",
      "biography": "I was born and raised in Arvada, CO. My father worked his way up from a field picker to a construction worker, having worked on building the Eisenhower tunnel and the mines in Idaho Springs. He eventually made his way to the Front Range where he worked in an electrical distribution plant. He taught me that I could achieve anything with hard-work and integrity - the same values that make the United States of America the greatest country in the world. I applied our American values to every aspect of my life. After graduating Arvada High School, I decided to defend our values and our Constitution by joining the Marine Corps. While in the Marines, I served as a combat engineer in South America. I earned the great honor of being a marksmanship instructor for all ranks of soldiers from new recruits to battalion commanders. Serving my country enabled me to see the needs and importance of all people, no matter their class, color or creed. I developed empathy and a desire to be a public servant when I witnessed the lack of rights and freedoms other countries struggled with firsthand. This made me appreciate how grateful I am for being born in the United States. After being honorably discharged from the Marines in 1990, I helped my father build his construction company, CCSI, which now competes for major projects across the Front Range. As a project manager and foreman, I spent many long hours on job sites from DIA to Rocky Flats and Peterson Airfield; putting the engineering and leadership skills I learned in the Marines to use. Life lead me to Xcel Energy, where I currently work as a foreman. Along with my role at Xcel I spend a lot of time giving back. I act as a veteran’s facilitator for newly discharged veterans. I help them acclimate from combat life to their professional lives. I also volunteer for Junior Achievement and am a part of the Xcel Energy Path to Leadership, which is a yearlong program that teaches upcoming leaders about the energy industry. I currently live in Brighton, Colorado with my two children, Nicholas, 13, and Erik, 11, where I served as a Commissioner on the Planning Commission since 2014. As I got older, I noticed that our country was losing the values of integrity and hard-work. Once the Democrats at the State Capitol slammed Bloomberg-sponsored gun laws and rural energy laws down Coloradan’s throats in 2013, I decided to get involved. I wanted my children to live in the America I once knew. In 2014, I joined the fight by working on former Congressman Tom Tancredo’s gubernatorial campaign. I helped connect Congressman Tancredo’s message of freedom and the American Dream to the Hispanic community. I am not a member of the political elite. I fought for liberty and the Constitution as a Marine, and my experience on the Tancredo campaign made me believe that I could do it again. I am representing Colorado House District 56 because I want my children to have the same opportunities America provided me. I believe in a government of the people, by the people, and for the people. My next work as a public servant will be to work for our community as your Representative. The best type of leader is the one who is willing to pick up a shovel alongside his employees to get the job done. I can be that leader. I will do everything in my power to restore integrity, hard work, and the American Dream.."
    },
    {
      "name": "Danielle Ongart",
      "title": "Director",
      "organization": "Adult Education Initiatives Colorado Department of Education",
      "session": "Wednesday, October 24, 2018 from 8:30 - 9:45",
      "biography": "Danielle Ongart is the Director of the Office of Adult Education Initiatives at the Colorado Department of Education (CDE). The office oversees federal and state grants to more than 25 programs around the state, providing technical assistance and data reporting. As a key partner in the implementation of the Workforce Innovation and Opportunity Act, the office collaborates with various state agencies to improve adult educational attainment that will lead to meaningful employment. Prior to CDE, Danielle was an Obama Administration political appointee at the US Department of Education where she developed guidance and regulations for the Every Student Succeeds Act and administered the distribution of $1 billion in federal funds. Danielle also worked in Denver Public Schools as the Associate Director of Professional Learning Implementation, where she wrote the observation and professionalism framewo work that is part of the teacher growth and performance system for 5,000 educators. Danielle began her wo wo rk in education as an elementary and middle school teacher in the Washington Heights and Harlem neighborhoods of New York City, and was a proud founding teacher at New Heights Academy Charter School. Danielle holds a B.A. in Radio / TV / Film from Northwestern University and an M.S. in Teaching from Pace University."
    },
    {
      "name": "Dr. Misty Stroud",
      "title": "Dean of Instruction",
      "organization": "Morgan Community College",
      "session": "Wednesday, October 24, 2018 from 8:30 - 9:45",
      "biography": "Dr. Misty Stroud serves as the Dean of Instruction at Morgan Community College where she provides leadership and support to faculty so they can focus on what is most important – helping students achieve their goals. After dropping out of high school, Misty obtained her GED and started her academic career at a small, rural community college. She has since earned her B.S., M.S., and Ph.D., all while raising two children as a single mother. Due to her experience as a non-traditional student, Misty was inspired to teach in a community college and help other non-traditional students enrich their lives through education. Her passion for education has resulted in multiple awards for teaching and innovation, including the 2016 National Institute for Staff and Organizational Development (NISOD) Excellence Award.\n\n“The benchmark of a great society is not only its emphasis on education, but its commitment to providing educational opportunity to all of its members.” - Dr. Misty Stroud\n"
    },
    {
      "name": "Kathryn Wisner",
      "title": "Director - Pre-College and Transitional Studies",
      "organization": "Morgan Community College",
      "session": "Wednesday, October 24, 2018 from 11:45 - 1:00",
      "biography": "Kathryn Wisner is currently the Director of the Pre-College and Transitional Studies program at Morgan Community College. She works with anyone who’s interested in a career or college but needs a little help to get there.\n\nKathryn is a passionate believer in the fact that education is a catalyst that transforms lives and communities. Kathryn’s work has always focused around working with those who don't fit within the traditional educational framework from teaching special education kindergarteners to foreign attorneys in professional English classes her experiences with education run the gamut but one thing they've never been is typical.\n\nKathryn holds a Juris Doctorate with a focus and disability and education law as well as a Master’s degree focused in culturally diverse leadership from Syracuse University.Keynote Speakers\nKathryn Wisner"
    }
  ],
  "presenters": [
    {
      "name": "Adam Springwater",
      "vendor": "Yes",
      "organization": "Educational Testing Service (ETS) HiSET",
      "website": "https://hiset.ets.org/",
      "twitter": "@HiSET_ETS",
      "facebook": "https://www.facebook.com/ETSHiSET",
      "job-title": "Senior Manager, HiSET Program",
      "employer": "Educational Testing Service (ETS)",
      "biography": "Adam Springwater is responsible for overseeing the HiSET Program at the state level. He serves as the main point of contact for state clients, and provides HiSET information for adult education programs and other stakeholders. Prior to joining ETS, Adam worked with several HSE exam preparation companies, developing and marketing instructional tools. Adam has presented at numerous national and regional conventions, and to a wide range of adult education audiences. He received a B.A from Grinnell College and teaching credentials from Dominican College and Sonoma State University. ",
      "co-leaders": "N/A",
      "session": "Tuesday, Session 1",
      "location": "Bentley upstairs",
      "title": "ETS High School Equivalency Testing (HiSET®) Program Updates"
    },
    {
      "name": "Alexandra Soto",
      "vendor": "No",
      "job-title": "Outreach & Adult Education Program Coordinator",
      "employer": "Spring Institute for Intercultural Learning",
      "biography": "Alexandra Soto is the Outreach & Adult Education Program Coordinator for Spring Institute for Intercultural Learning. She has been providing quality services to adult learners for four years and has helped to improve program retention and engagement, among other measures. Alexandra has provided outreach and marketing for small business, including website management, event outreach, and development of marketing strategies. Part of her role with Spring Institute includes managing the Facebook page, preparing monthly newsletters, and developing annual reports and other promotional materials.",
      "co-leaders": "None",
      "session": "Wednesday, Session 8",
      "location": "Ballroom A",
      "title": "Engaging Learners thru Social Media & Free Marketing Tools"
    },
    {
      "name": "Allie Needham",
      "vendor": "No",
      "job-title": "Student Navigator / ELA Instructor",
      "employer": "Spring Institute for Intercultural Learning",
      "biography": "Needham is the Student Navigator / ELA Instructor at Spring Institute. She has taught and studied ESL in Asia and the U.S., working primarily with adult students of diverse cultures. Needham implements the practical use of technology in her lessons to support students in career readiness skills. \n\nEasterday’s background includes teaching and program management in ESL, Adult Edu., International Edu. and Academic Advising across continents. She has worked with immigrant and refugee students in various fields of study. Her skills include assessment, curriculum development and teacher training.",
      "co-leaders": "Karen Easterday",
      "session": "Tuesday, Session 1",
      "location": "Ballroom A",
      "title": "Using Online Distance Learning with Adult ESL Students to Enhance Program Outcomes"
    },
    {
      "name": "Anne Petti",
      "vendor": "No",
      "job-title": "Director, Center for Workforce Development",
      "employer": "Community College of Aurora",
      "biography": "Ms. Petti graduated with an M.A. in TESOL from Michigan State University. She has taught ESL in the U.S., as well as overseas. For over 5 years, she worked as a Manager in the Adult Education program at Pima Community College in Tucson, AZ. In her current position as Director of the Center for Workforce Development at the Community College of Aurora, she oversees the High School Equivalency (GED), Community ESL, Citizenship, and Bridge programs. In addition to being a language teacher, she is also a language learner. Over the years, she has become proficient in four languages besides English.",
      "co-leaders": "Valerie Gantzler",
      "session": "Tuesday, Session 2",
      "location": "Ballroom B",
      "title": "A Tale of Two Career Pathway Programs",
      "session2": "Wednesday, Session 7",
      "location2": "Ballroom B",
      "title2": "A Tale of Two Career Pathway Programs"
    },
    {
      "name": "Brenda Gierczak",
      "vendor": "No",
      "job-title": "Instructor",
      "employer": "Community College of Aurora",
      "biography": "Ms. Gierczak has an MA in Organizational Management. She works in the HSE program at the Community College of Aurora (CCA) teaching Language Arts and Social Studies. \n\nMs. Graham has an M.Ed. in Curriculum and Instruction. She works for the CCA in the HSE program, for Aurora Public Schools teaching homeschool children and teaches inmates HSE at the Denver Jails.\n\nPaige Wenzivsky holds an MS in Special Education from the University of Northern Colorado. She currently serves as an ABE instructor with CCA's HSE program both on ground and online. \n",
      "co-leaders": "Beckie Graham, Paige Wenzivsky",
      "session": "Tuesday, Session 3",
      "location": "Ballroom D 1",
      "title": "Developing an integrated curriculum project in math and language arts using the CCR Standards. "
    },
    {
      "name": "Cedric Lindsay",
      "vendor": "No",
      "job-title": "Student Success Coach",
      "employer": "The Learning Source",
      "biography": "Being welcomed into The Learning Source as Student Success Coach, Cedric has experience in K-12 education, Colorado Community College Systems, and Adult Education. Previously with the Adams 14 Adult Learning Center, he taught all levels of adult education and worked to further career services through developing business relationships, resume preparation, and creating student-centered workshops. Most recently, working for The Learning Source, building connections with community leaders and businesses while helping adult students increase persistence and discover their potential.",
      "co-leaders": "n/a",
      "session": "Wednesday, Session 5",
      "location": "Ballroom D 1",
      "title": "Growth Mindset"
    },
    {
      "name": "Chelsea Beard",
      "vendor": "No",
      "job-title": "Disability Resource Coordinator",
      "employer": "Arapahoe Douglas Works! Workforce Center",
      "biography": "Hi! I am Chelsea Beard, Disability Resource Coordinator at Arapahoe Douglas Works! Workforce Center. I started at ADWorks! as a Career Services Advisor working on the RESEA and TAA programs. I was very excited when the DEI grant came along and knew that being a DRC would be the perfect fit for me because I have a background in Special Education! \n\nWith the funds from the DEI grant, I hope to implement financial literacy and education programs to AD Works, as well as increase access to the workforce system for individuals with disabilities. ",
      "co-leaders": "Shannon Bishop, Julie Cook",
      "session": "Tuesday, Session 4",
      "location": "Ballroom B",
      "title": "Disability Employment Initiative: An Innovative Approach to Working with Individuals with Disabilities"
    },
    {
      "name": "Danielle Ongart",
      "vendor": "No",
      "job-title": "Director of Adult Education",
      "employer": "Colorado Department of Education",
      "biography": "Dr. Suzie Carmack, PhD, MFA, MEd, is a Principal Communication and Well-Being Researcher at American Institutes for Research (AIR). She has 28 years of experience working internationally in the strategic communication field, as well as 26 years of concurrent experience as a curriculum developer, college-level teacher, and professional development trainer. At AIR she brings research into real-world practice by exploring ways that communication, mindfulness and compassion can improve workplace performance, productivity, engagement and well-being outcomes in healthcare, education and military contexts.\n\nDr. Marcela Movit, PhD, is a researcher at AIR with expertise in the areas of adult learning and professional development and training. Through her recent work in California, Nevada, and Texas, she has supported state and local adult education programs’ efforts to improve instruction for greater student outcomes. She also recently led the technical assistance task on the Improving Adult English-Language Instruction project, which helped to build state's’ capacity to improve and sustain the effectiveness of adult English as a Second Language (ESL) teachers.\nDahlia Shaewitz, Managing Director, AIR, is the Practice Area Director for Disability and Rehabilitation with the goal of improving competitive employment outcomes for qualified adults with disabilities. She also directs projects to support accountability, research, and professional development for the adult literacy field. She is also the deputy project director for the national accountability system for adult education funded through the U.S. Office of Career, Technical, and Adult Education (OCTAE), for which she provides policy guidance and support to Federal and state agencies, and designs and implements training on accountability issues including changes due to the Workforce Innovation and Opportunity Act. She recently developed an online training course for the New York State Literacy Zones case managers to improve data quality and use. Ms. Shaewitz supported the Preparing Adult English Language Learners for Rigorous College and Career Ready Standards project through a task to review the alignment of these standards to the current accountability system educational functioning levels.\n\nDanielle Ongart is the Director of Education for Adult Education Initiatives for the state of Colorado. She has dedicated her career and personal life to improving systems and processes with the goal of creating more equitable outcomes, and she has deep expertise in education policy at all levels of government, as well as experience improving access for traditionally underserved communities. \n",
      "co-leaders": "Dr. Suzie Carmack, AIR; Dahlia Shaewitz, AIR; Marcela Movit, AIR",
      "session": "Tuesday, Session 3 & 4",
      "location": "Ballroom C",
      "title": "Colorado Adult Education: a Participatory Workshop for Innovation, Opportunity and Action"
    },
    {
      "name": "Debbie Goldman",
      "vendor": "No",
      "job-title": "Teacher Trainer",
      "employer": "Intercambio Uniting Communities",
      "biography": "Debbie Goldman has over 30 years of experience teaching English to students of all ages and levels. She is currently in charge of teacher training at Intercambio Uniting Communities, where she develops and delivers both pre and in-service training to about 250 volunteers each year. She is a certified trainer for the SIT TESOL Certificate course and has trained teachers both abroad and in the US.\nDebbie has a BS in Spanish and Linguistics from Georgetown University as well as an MA in TEFL.\n",
      "co-leaders": "no co-leaders",
      "session": "Wednesday, Session 6",
      "location": "Ballroom A",
      "title": "Expanding Your ESL Toolkit"
    },
    {
      "name": "Donna Kapp",
      "vendor": "No",
      "job-title": "Coordinator, Academic Transitions",
      "employer": "FSI/Community College of Denver",
      "biography": "Donna discovered her passion for adult education while volunteering at EGTC almost 15 years ago. Since then, she has earned a Certificate in English Language Teaching to Adults (CELTA) and a Master’s degree in Adult Education. She’s taught ABE, community and college level ESL, including Business English in Mongolia, managed training programs for refugees, and written contextualized curriculum for adults transitioning into careers and college-level studies. Topics she is currently exploring include experiential learning, growth mindset, and student success and retention strategies. ",
      "co-leaders": "none",
      "session": "Tuesday, Session 4",
      "location": "Ballroom D 1",
      "title": "Learning is Hard: Growth Mindset in Adult Education"
    },
    {
      "name": "Dorothea Steinke",
      "vendor": "No",
      "job-title": "owner",
      "employer": "NumberWorks LLC",
      "biography": "Dorothea Steinke is an adult numeracy specialist with over 10 years experience teaching math to adults. She presents frequently at local/regional/national conferences, including a guest presentation on LINCS. She currently serves on the board of the Literacy Coalition of Colorado and is the Colorado representative of the Adult Numeracy Network.",
      "co-leaders": "none",
      "session": "Wednesday, Session 7",
      "location": "Ballroom A",
      "title": "How Big Is It?"
    },
    {
      "name": "Ellen Klement",
      "vendor": "No",
      "job-title": "HSE Instructor",
      "employer": "Foundational Skills Institute @ CCD",
      "biography": "Ellen was a counselor before embarking on a teaching career. Completing her MA in Somatic Psychology in 1998, Ellen uses the skills she learned working with trauma survivors to help students overcome their anxieties about learning to empower them towards successful outcomes in the classroom and life. Starting out as an ESL volunteer in 2001, Ellen has been a classroom teacher for the past eight years. She loves the innovation and flexibility required to address all the different brains within her classroom.",
      "co-leaders": "None",
      "session": "Wednesday, Session 8",
      "location": "Ballroom B",
      "title": "Emotions in Motion"
    },
    {
      "name": "George O'Clair",
      "vendor": "No",
      "job-title": "Director of Workplace Education",
      "employer": "Cargill/MCC",
      "biography": "I worked with 14 different corporations to find out what was needed in in their company and how the education system could help. I work directly with Cargill's training specialist to develop classes to meet the needs of the public. ",
      "co-leaders": "Panel of students and their teachers. Rachel Nichols",
      "session": "Tuesday, Session 2",
      "location": "Ballroom D 1",
      "title": "Panel of Students Ambassadors and their barriers.",
      "session2": "Wednesday, Session 6",
      "location2": "Ballroom B",
      "title2": "Trade classes all students know this before entering into class.",
      "session3": "Wednesday, Session 7",
      "location3": "Ballroom C",
      "title3": "Education, Working inside a corporation."
    },
    {
      "name": "Jessie Hawthorn",
      "vendor": "No",
      "job-title": "Coordinator",
      "employer": "ACSD 14 Adult Learning Center",
      "biography": "Jessie Hawthorn has been working with adult learners since 1998. She trained adult educators around the state while at CDE from 2008-14. Jessie, and co-presenters, Bethany Macarus and Natalia Devlin, have graduate degrees with a focus on language acquisition. Jessie taught at universities in Ethiopia and Mexico. Natalia taught at a university in Russia and studied in Germany. She is fluent in Russian and German. Bethany taught at a university in China and a community college Illinois and speaks Chinese. Bethany serves as the Learning Lab Coordinator at ACSD14 Adult Learning Center.",
      "co-leaders": "Bethany Macarus, Natalia Devlin",
      "session": "Tuesday, Session 1 & 2",
      "location": "Ballroom C",
      "title": "Online Learning - Yes, you can!"
    },
    {
      "name": "Leann Kaiser",
      "vendor": "No",
      "job-title": "Assistant Professor",
      "employer": "Colorado State University",
      "biography": "Leann Kaiser holds a Ph.D. in adult and post-secondary education from the University of Wyoming, a M.S. from Arizona State University, and a B.S. from the University of Wyoming. Leann's teaching and research interests encompass adult teaching and learning theory, learning transfer, experiential learning, and distance student educational experiences. Leann has taught in the fields of adult education and outdoor education at the post-secondary level since 2001. Her other professional experience includes work in natural resource education programming and public land management.",
      "co-leaders": "none",
      "session": "Wednesday, Session 6",
      "location": "Ballroom D 1",
      "title": "Experiential Learning Step By Step: How to Plan and Facilitate Using This Powerful Teaching Method",
      "session2": "Wednesday, Session 8",
      "location2": "Bentley upstairs",
      "title2": "I'm Not a “Theory” Person: Practical Ideas and Applications to Help YOU Use Theory to Improve Your Teaching"
    },
    {
      "name": "Liz Lanphear",
      "vendor": "Yes",
      "organization": "GED Testing Service",
      "website": "http://www.ged.com ",
      "twitter": "@GEDTesting",
      "facebook": "https://www.facebook.com/GEDTesting",
      "job-title": "State Relationship Manager",
      "employer": "GED Testing Service",
      "biography": "Liz Lanphear has over ten years of experience in Adult Education serving as a GED Examiner, Adult Basic Education Instructor, Program Coordinator, Program Director, and as the Kansas State GED Administrator with Kansas Board of Regents prior to starting with GED Testing Service. Liz has a Master degree in Adult Education from Kansas State University.",
      "co-leaders": "none",
      "session": "Tuesday, Session 2",
      "location": "Bentley upstairs",
      "title": "Promises Kept: GED® Innovation: New Tools and Resources for Students and Educators, and Updates on GEDWorks, Student Outcomes and Postsecondary Success"
    },
    {
      "name": "Marsea Wynne",
      "vendor": "No",
      "job-title": "Accelerated Program Navigation Coordinator",
      "employer": "Community College of Denver",
      "biography": "Marsea helps adult learners navigate the Accelerated career pathways program for the Foundational Skills Institute (FSI) at CCD. In 2015 she was tasked with implementing the CCD State Adult Education & Literacy grant, which served as a pilot for FSI's current integrated education and training program design. She is actively involved in the adult education community, along with workforce and community service organizations. She enjoys collaborating with navigators and instructors from multiple adult education programs.",
      "co-leaders": "Navigators",
      "session": "Wednesday, Session 6",
      "location": "Ballroom C",
      "title": "Career Pathways Navigators Meeting"
    },
    {
      "name": "Martin Loa",
      "vendor": "Yes",
      "organization": "BurlingtonEnglish",
      "website": "https://www.burlingtonenglish.com/",
      "twitter": "@BurlingtonEng",
      "facebook": "https://www.facebook.com/BurlingtonEng",
      "job-title": "Customer Manager",
      "employer": "BurlingtonEnglish",
      "biography": "Martin Loa currently serves as Customer Manager in Colorado for BurlingtonEnglish. Previously he served as Vice President of Program Services for Houston Center for Literacy the Mayor’s Commission on Adult Education. Where he supported the literacy organizations, engaged the community to join efforts in solving Houston’s low literacy problem, and connected adult learners to literacy providers. ",
      "co-leaders": "None",
      "session": "Tuesday, Session 3",
      "location": "Bentley upstairs",
      "title": "Preparing your adult learners for success in the workforce"
    },
    {
      "name": "Sarah Wilkins",
      "vendor": "Yes",
      "organization": "Kentucky Educational Television (KET)",
      "website": "https://www.ket.org/",
      "twitter": "@KET",
      "facebook": "https://www.facebook.com/KET",
      "job-title": "Director, Adult Education and Workforce Training",
      "employer": "KET",
      "biography": "Dr. Sarah Wilkins is the Director of Adult Education and Workforce Training at Kentucky Educational Television (KET). In this position, she is charged with overseeing the development, management, evaluation, and promotion of KET’s adult education endeavors, both in Kentucky and nationally. Before joining KET, Wilkins spent over 20 years as a teacher and administrator in postsecondary institutions. She holds bachelor’s and master’s degrees in elementary education and a doctorate from the University of Kentucky in Educational Policy Studies and Evaluation.",
      "co-leaders": "none",
      "session": "Tuesday, Session 4",
      "location": "Bentley upstairs",
      "title": "Online Tools for Test and Work Prep "
    },
    {
      "name": "Stephanie Lindberg",
      "vendor": "No",
      "job-title": "Learning Specialist",
      "employer": "Community College of Denver- Foundational Skills Institute",
      "biography": "Stephanie Lindberg has been working in adult education for the last eight years. She currently teaches HSE classes at the Community College of Denver and college composition at Pikes Peak Community College. ",
      "co-leaders": "none",
      "session": "Tuesday, Session 2",
      "location": "Ballroom A",
      "title": "Teaching Teachers How to Tech",
      "session2": "Wednesday, Session 5",
      "location2": "Ballroom A",
      "title2": "Teaching Teachers How to Tech"
    },
    {
      "name": "Talya Clay",
      "vendor": "Yes",
      "organization": "National Geographic Learning",
      "website": "https://ngl.cengage.com/search/showresults.do?N=200+4294918395",
      "twitter": "@NatGeo",
      "facebook": "https://www.facebook.com/ELTNGLUnitedStates",
      "job-title": "SENIOR EDUCATIONAL SALES CONSULTANT",
      "employer": "National Geographic Learning/Cengage Learning",
      "biography": "Talya Clay (CELTA certified) has been dedicated to language learning since 1999 in a variety of settings including public schools and libraries as well as private language schools and companies. Her love of language and culture have taken her to Paraguay, Spain, and Brazil for extended stays. She is proud to be raising bilingual daughters in her own Brazilian Portuguese language lab in Seattle.",
      "co-leaders": "N/A",
      "session": "Wednesday, Session 5",
      "location": "Bentley upstairs",
      "title": "Preparing Students for Success in the 21st Century with authentic National Geographic content"
    },
    {
      "name": "Tara Keily",
      "vendor": "Yes",
      "organization": "Aztec Software",
      "website": "http://www.aztecsoftware.com/",
      "twitter": "@aztecsoftware",
      "job-title": "Regional Account Manager",
      "employer": "Aztec Software",
      "biography": "Tara Keily has been with Aztec Software since July 2016. Previously to joining the Aztec team, she has been serving the education market for over 15 years. During her tenure in the education market, she has worked with the K-12 division, workforce development, adult basic education and the private sector as an educational sales consultant. She joined Aztec Software because she has a passion for adult education and believes the future success of the adult student in the workforce depends on the student being familiar with computer and technology. ",
      "co-leaders": "Jonathan Blitt",
      "session": "Tuesday, Session 3",
      "location": "Ballroom B",
      "title": "Practice for Knowledge Acquisition Towards GED Success",
      "session2": "Wednesday, Session 7",
      "location2": "Bentley upstairs",
      "title2": "Practice for Knowledge Acquisition Towards GED Success"
    },
    {
      "name": "Teona Shainidze Krebs",
      "vendor": "No",
      "job-title": "Adult Education Head",
      "employer": "Pikes Peak Library District",
      "biography": "Teona Shainidze Krebs is the Adult Education head for Pikes Peak Library District. She provides leadership and facilitation for a multi-site adult education program. She works with community support organizations, assuring the importance of education and related services are promoted throughout PPLD’s service area. Teona is a CAEPA board member, and a corresponding member of Library Services to Multicultural Populations at International Federation of Library Associations and Institutions. She was born and raised in Batumi, in the country of Georgia.",
      "co-leaders": "Lacey Miller, Michael Bittner, Kyle Beargeon",
      "session": "Tuesday, Session 1",
      "location": "Ballroom B",
      "title": "The Cooperative Enterprise: Facilitating Multilevel & Multidisciplinary Classes"
    },
    {
      "name": "The Office of Adult Education Initiatives",
      "vendor": "No",
      "job-title": "Director, Office of Adult Education Initiatives",
      "employer": "Colorado Department of Education",
      "biography": "The Office of Adult Education Initiatives team members are:\nLaura Anderson, Program Coordinator\nAmanda Brewer, Program Coordinator\nFumnanya Camara, Re-engagement Coordinator\nMichelle Crawford, Office and Program Support\nGaye Horne, Program Coordinator\nGalen Mitchell, Instructional Support & Professional Learning Coordinator\nDanielle Ongart, Director of Adult Education\n",
      "co-leaders": "Laura Anderson, Amanda Brewer, Fumnanya Camara, Michelle Crawford, Gaye Horne, Galen Mitchell,",
      "session": "Tuesday, Session 1",
      "location": "Ballroom D 1",
      "title": "CDE AEI Team Meet and Greet"
    },
    {
      "name": "Valerie M. Gantzler",
      "vendor": "No",
      "job-title": "Coordinator, Accelerated Pathways to Success",
      "employer": "Community College of Aurora",
      "biography": "Valerie Gantzler is the Accelerated Pathways to Success program coordinator at the Community College of Colorado (CCA). The program provides a bridge for students preparing for certificate programs, offers tutoring throughout the program, and assists students in obtaining employment post-graduation. Valerie has worked at CCA for three years in Colorado Adult Education and Literacy grant-funded programs and has spent over ten years in adult education. Due to her combined passion for teaching and data she also acts as the system administrator for LACES, TABE DRC, and Salesforce databases. ",
      "co-leaders": "Anne Petti",
      "session": "Wednesday, Session 5",
      "location": "Ballroom B",
      "title": "Who’s Your Data? Part II"
    }
  ],
  "sessions": [
    {
      "name": "Allie Needham",
      "vendor": "No",
      "job-title": "Student Navigator / ELA Instructor",
      "employer": "Spring Institute for Intercultural Learning",
      "biography": "Needham is the Student Navigator / ELA Instructor at Spring Institute. She has taught and studied ESL in Asia and the U.S., working primarily with adult students of diverse cultures. Needham implements the practical use of technology in her lessons to support students in career readiness skills. \n\nEasterday’s background includes teaching and program management in ESL, Adult Edu., International Edu. and Academic Advising across continents. She has worked with immigrant and refugee students in various fields of study. Her skills include assessment, curriculum development and teacher training.",
      "co-leaders": "Karen Easterday",
      "session": "Tuesday, Session 1",
      "location": "Ballroom A",
      "title": "Using Online Distance Learning with Adult ESL Students to Enhance Program Outcomes",
      "objective": "1. Participants will examine survey results measuring student engagement, enjoyment and critique of the online component.\n2. Participants will reflect on the benefits and challenges of using online course tools. \n3. Participants will determine how to align program goals and outcomes with students' goals. ",
      "audience": "Faculty",
      "abstract": "How do adult ESL students perceive using an online learning course component in addition to in-class work? How does the component help students enhance their proficiency in English and improve their career skills? How do students’ perceptions align with program goals and outcomes? \nPresenters will convey the results of a survey measuring students’ perceptions of the benefits and challenges of an online learning component. Participants will analyze and discuss implications of students’ use of technology in language learning as it relates to career building and program outcomes.",
      "strand": "Digital Literacy"
    },
    {
      "name": "Teona Shainidze Krebs",
      "vendor": "No",
      "job-title": "Adult Education Head",
      "employer": "Pikes Peak Library District",
      "biography": "Teona Shainidze Krebs is the Adult Education head for Pikes Peak Library District. She provides leadership and facilitation for a multi-site adult education program. She works with community support organizations, assuring the importance of education and related services are promoted throughout PPLD’s service area. Teona is a CAEPA board member, and a corresponding member of Library Services to Multicultural Populations at International Federation of Library Associations and Institutions. She was born and raised in Batumi, in the country of Georgia.",
      "co-leaders": "Lacey Miller, Michael Bittner, Kyle Beargeon",
      "session": "Tuesday, Session 1",
      "location": "Ballroom B",
      "title": "The Cooperative Enterprise: Facilitating Multilevel & Multidisciplinary Classes",
      "objective": "1. Identify strengths and weaknesses of teaching multilevel, multidisciplinary classes. 2. Analyze different classroom structures to fit each program’s needs. ",
      "audience": "Students, Faculty, Admin, Partners",
      "abstract": "Multi-level, multi-subject classes? Limited number of instructors? Students in need of math instruction, but restricted to a language location or schedule? Learners entering the class mid-term? These are common adult education struggles. Learn from Pikes Peak Library District Adult Education’s ongoing journey as we adapt from traditional instruction to multiple levels and subjects in a single classroom, without students feeling neglected. In this session, we will discuss program struggles and successes, apprehensions and initial resistance to this shift, and provide suggestions and resources to take this dialogue into your own programs.",
      "strand": "Best Practices, Diverse Learners, Evidence & Research to Practice"
    },
    {
      "name": "Danielle Ongart",
      "vendor": "No",
      "job-title": "Director, Office of Adult Education Initiatives",
      "employer": "Colorado Department of Education",
      "biography": "The Office of Adult Education Initiatives team members are:\nLaura Anderson, Program Coordinator\nAmanda Brewer, Program Coordinator\nFumnanya Camara, Re-engagement Coordinator\nMichelle Crawford, Office and Program Support\nGaye Horne, Program Coordinator\nGalen Mitchell, Instructional Support & Professional Learning Coordinator\nDanielle Ongart, Director of Adult Education\n",
      "co-leaders": "Laura Anderson, Amanda Brewer, Fumnanya Camara, Michelle Crawford, Gaye Horne, Galen Mitchell,",
      "session": "Tuesday, Session 1",
      "location": "Ballroom D 1",
      "title": "CDE AEI Team Meet and Greet",
      "objective": "Meet Colorado Department of Education Office of Adult Education Initiatives team members in an informal setting and get questions you may have answered.",
      "audience": "Faculty, Admin, Partners",
      "abstract": "Participants will meet Colorado Department of Education (CDE) Office of Adult Education Initiatives (AEI) team members and discuss areas of interest related to the federal Adult Education and Family Literacy Act (AEFLA) grant and/or the state Adult Education Literacy (AELA) grant. Team members will be available to answer questions about such topics as Adult Basic Education Authorization (ABEA), the LACES data system, assessments, Accessible Design and data reporting. Everyone is welcome to attend this session! Please consider attending not only if you have questions but also if you have feedback for the team.",
      "strand": "Policy and Legislation"
    },
    {
      "name": "Adam Springwater",
      "vendor": "Yes",
      "organization": "Educational Testing Service (ETS) HiSET",
      "website": "https://hiset.ets.org/",
      "twitter": "@HiSET_ETS",
      "facebook": "https://www.facebook.com/ETSHiSET",
      "job-title": "Senior Manager, HiSET Program",
      "employer": "Educational Testing Service (ETS)",
      "biography": "Adam Springwater is responsible for overseeing the HiSET Program at the state level. He serves as the main point of contact for state clients, and provides HiSET information for adult education programs and other stakeholders. Prior to joining ETS, Adam worked with several HSE exam preparation companies, developing and marketing instructional tools. Adam has presented at numerous national and regional conventions, and to a wide range of adult education audiences. He received a B.A from Grinnell College and teaching credentials from Dominican College and Sonoma State University. ",
      "co-leaders": "N/A",
      "session": "Tuesday, Session 1",
      "location": "Bentley upstairs",
      "title": "ETS High School Equivalency Testing (HiSET®) Program Updates",
      "objective": "The HiSET presenter will discuss:\n\n1. How the HiSET exam aligns with the College and Career Readiness Standards for Adult Education;\n2. 2019 HiSET Program updates;\n3. A quick overview of the HiSET Data Manager and Online Portal;\n4. An overlook of the HiSET Website. Where to find key information, and how to use it;\n5. Free HiSET marketing materials available to promote your program;\n6. Test prep strategies using HiSET resources to prepare and assess your students readiness;\n7. An overview of the test preparation, test administration, accommodations options, ETS customer service, scoring and reporting. ",
      "audience": "Faculty, Admin",
      "abstract": "In this proposed session the presenter will demonstrate how the HiSET exam aligns with the College and Career Readiness Standards for Adult Education granting individuals without a high school diploma an opportunity to earn a state-issued high school equivalency credential and move toward post-secondary education or a better career. A slide deck will be shown to provide an overview and facilitate a discussion on all program updates and teaching resources. Participants will hear an overview of the program, test preparation, test administration, accommodations options, ETS customer service, scoring and reporting. The presenter will discuss any new program initiatives, and provided with an update on new marketing materials created and successful efforts taken as part of the test taker outreach campaign. Information about partnerships with preparation providers will also be highlighted. Participants will also be able to converse with and ask questions regarding the exam with a HiSET Program Manager. ",
      "strand": "Advocacy (Emphasis Educate and Elevate), Vendor/Business, High School Equivalency"
    },
    {
      "name": "Jessie Hawthorn",
      "vendor": "No",
      "job-title": "Coordinator",
      "employer": "ACSD 14 Adult Learning Center",
      "biography": "Jessie Hawthorn has been working with adult learners since 1998. She trained adult educators around the state while at CDE from 2008-14. Jessie, and co-presenters, Bethany Macarus and Natalia Devlin, have graduate degrees with a focus on language acquisition. Jessie taught at universities in Ethiopia and Mexico. Natalia taught at a university in Russia and studied in Germany. She is fluent in Russian and German. Bethany taught at a university in China and a community college Illinois and speaks Chinese. Bethany serves as the Learning Lab Coordinator at ACSD14 Adult Learning Center.",
      "co-leaders": "Bethany Macarus, Natalia Devlin",
      "session": "Tuesday, Session 1 & 2",
      "location": "Ballroom C",
      "title": "Online Learning - Yes, you can!",
      "objective": "1) Explore the value in integrating digital literacy skills and using online learning platforms in ESL, ABE and ASE courses\n2) Identify barriers in using blended and/or distance learning models\n3) Reflect on your use of blended and/or distance learning and compare this to to the experience of adult educators at ACSD14 Adult Learning Center\n4) Identify opportunities to integrate blended and/or distance learning at your program or expand upon what you are doing",
      "audience": "Faculty, Admin",
      "abstract": "Is your goal to help your learners be independent and self sufficient - in and out of your classroom? If so, it is imperative that they are able to take control of their learning. In the 21st Century, one way to do this is through the effective use of portable electronic devices and computers. Participants will begin by exploring the value of integrating digital literacy skills and using online learning platforms in ESL, ABE and ASE courses. It is easy to get hung up on all the reasons why this is difficult. We will acknowledge the elephant in the room...provide a resource list for adult educators and learners to get low cost internet service and computers...and move on. We will share our program’s unique, recently implemented, approach to introducing online learning. It has been a bumpy road, but it is worth it. We will share what learners say about our approach. We will share about the platforms we use. There will be opportunity for questions and for you to share what has worked for you. End your time with us by identifying opportunities to integrate online learning at your program or expand upon what you are doing.",
      "strand": "Best Practices, Digital Literacy"
    },
    {
      "name": "Stephanie Lindberg",
      "vendor": "No",
      "job-title": "Learning Specialist",
      "employer": "Community College of Denver- Foundational Skills Institute",
      "biography": "Stephanie Lindberg has been working in adult education for the last eight years. She currently teaches HSE classes at the Community College of Denver and college composition at Pikes Peak Community College. ",
      "co-leaders": "none",
      "session": "Tuesday, Session 2",
      "location": "Ballroom A",
      "title": "Teaching Teachers How to Tech",
      "objective": "Participants will learn: best practices for effective technology use in the classroom and beyond; how to identify effective technology for your students; ways to increase your own tech abilities.",
      "audience": "Faculty",
      "abstract": "Do you want to use technology, and don't know how? Are you overwhelmed by the number of websites that offer OER (open educational resources)? Are you unfamiliar with using some aspects of technology? Digital literacy is important for all students, but if you struggle with integration of technology, this session is for you! We will discuss some best practices for effective technology use in the classroom (and beyond), provide ways to identify effective technology for your students, and learn about ways to increase your own tech abilities. Come ready to learn about technology! Access to the internet will be helpful, but not required.",
      "strand": "Best Practices, Digital Literacy"
    },
    {
      "name": "Anne Petti",
      "vendor": "No",
      "job-title": "Director, Center for Workforce Development",
      "employer": "Community College of Aurora",
      "biography": "Ms. Petti graduated with an M.A. in TESOL from Michigan State University. She has taught ESL in the U.S., as well as overseas. For over 5 years, she worked as a Manager in the Adult Education program at Pima Community College in Tucson, AZ. In her current position as Director of the Center for Workforce Development at the Community College of Aurora, she oversees the High School Equivalency (GED), Community ESL, Citizenship, and Bridge programs. In addition to being a language teacher, she is also a language learner. Over the years, she has become proficient in four languages besides English.",
      "co-leaders": "Valerie Gantzler",
      "session": "Tuesday, Session 2",
      "location": "Ballroom B",
      "title": "A Tale of Two Career Pathway Programs",
      "objective": "- Learn about the two Career Pathway models CCA has implemented\n- Learn about some of the challenges the program has faced, and how they arrived at effective practices\n- Hear about specific best practices that have been developed in areas such as student screening and intakes, working with partners, implementing wrap-around supports, messaging to students, and building relationships with internal and external partners, as well as with students\n- Learn about the challenges and successes the program has experienced in coordinating between the non-credit and credit sides of the college\n- Hear about student success stories!",
      "audience": "Faculty, Admin, Partners",
      "abstract": "This presentation will give an overview of the Career Pathways programs that have been implemented at the Community College of Aurora, and lessons that have been learned. Specifically, the presenters will discuss best practices they have developed around vetting participants, working with partners, messaging to students, the value of wrap-around supports, and the importance of relationship-building, and share some student success stories!",
      "strand": "Best Practices"
    },
    {
      "name": "George O'Clair",
      "vendor": "No",
      "job-title": "Director of Workplace Education",
      "employer": "Cargill/MCC",
      "biography": "This will be a panel of students who attended the student Ambassador training held on Monday. There will be a chance for the students to express what they learned and explain what barriers they have to overcome to go to school. This session will be held on October 23rd.",
      "co-leaders": "Panel of students and their teachers. Rachel Nichols",
      "session": "Tuesday, Session 2",
      "location": "Ballroom D 1",
      "title": "Panel of Students Ambassadors and their barriers.",
      "objective": "Learn the students barriers first hand, understand what they learned in the student ambassador training, understand what they will do for the next year to promote Educate and Elevate.",
      "audience": "Faculty, Admin, Partners",
      "abstract": "The participants of the this session will be able to have a question and answer time directed to the students and ambassadors. The participant will learn the students barriers first hand, understand what they learned in the student ambassador training, understand what they will do for the next year to promote Educate and Elevate.",
      "strand": "Advocacy (Emphasis Educate and Elevate), Students and Young Ambassadors"
    },
    {
      "name": "Liz Lanphear",
      "vendor": "Yes",
      "organization": "GED Testing Service",
      "website": "http://www.ged.com ",
      "twitter": "@GEDTesting",
      "facebook": "https://www.facebook.com/GEDTesting",
      "job-title": "State Relationship Manager",
      "employer": "GED Testing Service",
      "biography": "Liz Lanphear has over ten years of experience in Adult Education serving as a GED Examiner, Adult Basic Education Instructor, Program Coordinator, Program Director, and as the Kansas State GED Administrator with Kansas Board of Regents prior to starting with GED Testing Service. Liz has a Master degree in Adult Education from Kansas State University.",
      "co-leaders": "none",
      "session": "Tuesday, Session 2",
      "location": "Bentley upstairs",
      "title": "Promises Kept: GED® Innovation: New Tools and Resources for Students and Educators, and Updates on GEDWorks, Student Outcomes and Postsecondary Success",
      "objective": "Participants will learn about student outcomes and resources to help students and educators be better prepared for and persist to the GED test.\n\nParticipants will learn about the new website filled with free tools for educators and administrators including handbooks, assessment guides, study guides and more. In addition, participants will learn about tools to assist them in increasing student volume and using data to drive outcomes: GED PrepConnect, GED Manager and GED Analytics.\n\nParticipants will also learn about new partnerships creating tools including free extended response videos as well as tools available to purchase for the classroom, such as GED Flash.",
      "audience": "Faculty, Admin",
      "abstract": "This session will focus on the new resources available to learners and educators to help them prepare for the GED test. Participants will hear about the new GED.com student experience (based on extensive student research), the study guides, GED Flash, updates on GEDWorks and student success outcomes and postsecondary success.",
      "strand": "Vendor/Business"
    },
    {
      "name": "Tara Keily",
      "vendor": "Yes",
      "organization": "Aztec Software",
      "website": "http://www.aztecsoftware.com/",
      "twitter": "@aztecsoftware",
      "job-title": "Regional Account Manager",
      "employer": "Aztec Software",
      "biography": " Tara Keily has been with Aztec Software since July 2016. Previously to joining the Aztec team, she has been serving the education market for over 15 years. During her tenure in the education market, she has worked with the K-12 division, workforce development, adult basic education and the private sector as an educational sales consultant. She joined Aztec Software because she has a passion for adult education and believes the future success of the adult student in the workforce depends on the student being familiar with computer and technology. ",
      "co-leaders": "Jonathan Blitt",
      "session": "Tuesday, Session 3",
      "location": "Ballroom B",
      "title": "Practice for Knowledge Acquisition Towards GED Success",
      "objective": "It doesn't matter what subject you are teaching, differences in students’ performance are affected by how much they engage in deliberate practice and preparation. Deliberate practice occurs when an individual intentionally repeats an activity in order to improve performance. Come learn how Aztec Software’s Continuum of Learning series provides students with the goal of transferring knowledge that can purposely lead to improved learning performance, especially with the GED Test as we unveil GED Flash. Participants will be able to leave with their own demo log-in account. ",
      "audience": "Faculty, Admin",
      "abstract": "It doesn't matter what subject you are teaching, differences in students’ performance are affected by how much they engage in deliberate practice and preparation. Deliberate practice occurs when an individual intentionally repeats an activity in order to improve performance. Come learn how Aztec Software’s Continuum of Learning series provides students with the goal of transferring knowledge that can purposely lead to improved learning performance, especially with the GED Test as we unveil GED Flash. ",
      "strand": "College & Career Transitions, Digital Literacy, Evidence & Research to Practice"
    },
    {
      "name": "Brenda Gierczak",
      "vendor": "No",
      "job-title": "Instructor",
      "employer": "Community College of Aurora",
      "biography": "Ms. Gierczak has an MA in Organizational Management. She works in the HSE program at the Community College of Aurora (CCA) teaching Language Arts and Social Studies. \n\nMs. Graham has an M.Ed. in Curriculum and Instruction. She works for the CCA in the HSE program, for Aurora Public Schools teaching homeschool children and teaches inmates HSE at the Denver Jails.\n\nPaige Wenzivsky holds an MS in Special Education from the University of Northern Colorado. She currently serves as an ABE instructor with CCA's HSE program both on ground and online. \n",
      "co-leaders": "Beckie Graham, Paige Wenzivsky",
      "session": "Tuesday, Session 3",
      "location": "Ballroom D 1",
      "title": "Developing an integrated curriculum project in math and language arts using the CCR Standards. ",
      "objective": "This session will demonstrate how to use both the math and language arts CCR standards to create a unit of study within the ABE/ASE classroom. Participants will have the opportunity to explore a comprehensive unit that demonstrates the crossover of math and language arts in two specific classroom projects. Following this session, teachers will then be able to replicate these projects in their own classroom. There are many faucets to developing this type of curriculum, and can be used in either an ABE or ASE class or even a mixed class of students. Students who participate in this type of project are engaged both mentally, and physically. Participants in the session will have the opportunity to use smartphone technology, and learn how it can be useful in a classroom, as a tool to gauge student learning. ",
      "audience": "Faculty",
      "abstract": "This session will demonstrate how to develop a curriculum project that encompasses both the Language Arts and Math CCR Standards. Participants will enjoy learning different ways to involve students so they take ownership in the process. They will also enjoy using smartphone technology to encourage immediate feedback, which is very useful while working through the project. ",
      "strand": "Evidence & Research to Practice"
    },
    {
      "name": "Martin Loa",
      "vendor": "Yes",
      "organization": "BurlingtonEnglish",
      "website": "https://www.burlingtonenglish.com/",
      "twitter": "@BurlingtonEng",
      "facebook": "https://www.facebook.com/BurlingtonEng",
      "job-title": "Customer Manager",
      "employer": "BurlingtonEnglish",
      "biography": "Martin Loa currently serves as Customer Manager in Colorado for BurlingtonEnglish. Previously he served as Vice President of Program Services for Houston Center for Literacy the Mayor’s Commission on Adult Education. Where he supported the literacy organizations, engaged the community to join efforts in solving Houston’s low literacy problem, and connected adult learners to literacy providers. ",
      "co-leaders": "None",
      "session": "Tuesday, Session 3",
      "location": "Bentley upstairs",
      "title": "Preparing your adult learners for success in the workforce",
      "objective": "Do your adult learners struggle to find a job, retain a job or move up the career ladder? Do they need help understanding available career options, making informed career choices and developing essential workplace soft skills? BurlingtonEnglish new Career Exploration & Soft Skills course provides a blended curriculum that supports learners as they explore career clusters, plan career pathways, and learn critical interpersonal and workplace soft skills. Join our interactive session to see how our curriculum can help you meet the demands of WIOA by preparing your learners for success in today’s demanding workplace.\n",
      "audience": "Faculty, Partners",
      "abstract": "Do your adult learners struggle to find a job, retain a job or move up the career ladder? Do they need help understanding available career options, making informed career choices and developing essential workplace soft skills? BurlingtonEnglish new Career Exploration & Soft Skills course provides a blended curriculum that supports learners as they explore career clusters, plan career pathways, and learn critical interpersonal and workplace soft skills. Join our interactive session to see how our curriculum can help you meet the demands of WIOA by preparing your learners for success in today’s demanding workplace.",
      "strand": "Best Practices, College & Career Transitions, Digital Literacy"
    },
    {
      "name": "Danielle Ongart",
      "vendor": "No",
      "job-title": "Director of Adult Education",
      "employer": "Colorado Department of Education",
      "biography": "Dr. Suzie Carmack, PhD, MFA, MEd, is a Principal Communication and Well-Being Researcher at American Institutes for Research (AIR). She has 28 years of experience working internationally in the strategic communication field, as well as 26 years of concurrent experience as a curriculum developer, college-level teacher, and professional development trainer. At AIR she brings research into real-world practice by exploring ways that communication, mindfulness and compassion can improve workplace performance, productivity, engagement and well-being outcomes in healthcare, education and military contexts.\n\nDr. Marcela Movit, PhD, is a researcher at AIR with expertise in the areas of adult learning and professional development and training. Through her recent work in California, Nevada, and Texas, she has supported state and local adult education programs’ efforts to improve instruction for greater student outcomes. She also recently led the technical assistance task on the Improving Adult English-Language Instruction project, which helped to build state's’ capacity to improve and sustain the effectiveness of adult English as a Second Language (ESL) teachers.\nDahlia Shaewitz, Managing Director, AIR, is the Practice Area Director for Disability and Rehabilitation with the goal of improving competitive employment outcomes for qualified adults with disabilities. She also directs projects to support accountability, research, and professional development for the adult literacy field. She is also the deputy project director for the national accountability system for adult education funded through the U.S. Office of Career, Technical, and Adult Education (OCTAE), for which she provides policy guidance and support to Federal and state agencies, and designs and implements training on accountability issues including changes due to the Workforce Innovation and Opportunity Act. She recently developed an online training course for the New York State Literacy Zones case managers to improve data quality and use. Ms. Shaewitz supported the Preparing Adult English Language Learners for Rigorous College and Career Ready Standards project through a task to review the alignment of these standards to the current accountability system educational functioning levels.\n\nDanielle Ongart is the Director of Education for Adult Education Initiatives for the state of Colorado. She has dedicated her career and personal life to improving systems and processes with the goal of creating more equitable outcomes, and she has deep expertise in education policy at all levels of government, as well as experience improving access for traditionally underserved communities. \n",
      "co-leaders": "Dr. Suzie Carmack, AIR; Dahlia Shaewitz, AIR; Marcela Movit, AIR",
      "session": "Tuesday, Session 3 & 4",
      "location": "Ballroom C",
      "title": "Colorado Adult Education: a Participatory Workshop for Innovation, Opportunity and Action",
      "objective": "This session will have three sections. In the first section, participants will learn the results of an NRS-sponsored study conducted by the American Institutes for Research, which examined AEI collaboration efforts throughout the state of CO from their partners' perspectives. In the second section, participants will work in small groups to comment upon, validate and further inform this study's findings. In the third section, participants will engage in a discussion that will help AEI to prioritize its strategy efforts (based on input) and support efforts to improve CO adult education outcomes.",
      "audience": "Faculty, Admin, Partners",
      "abstract": "CO AEI welcomes you to join us for this participatory session, where we will collectively discuss and plan for future CO adult learning success. The session will have three sections. In the first section, participants will learn the results of an NRS-sponsored study conducted by the American Institutes for Research, which examined AEI collaboration efforts throughout the state of CO from their partners' perspectives. In the second section, participants will work in small groups to comment upon, validate and further inform this study's findings. In the third section, participants will engage in a discussion that will help AEI to prioritize its strategy efforts (based on input) and support efforts to improve CO adult education outcomes.",
      "strand": "College & Career Transitions, Evidence & Research to Practice, Workforce Development"
    },
    {
      "name": "Chelsea Beard",
      "vendor": "No",
      "job-title": "Disability Resource Coordinator",
      "employer": "Arapahoe Douglas Works! Workforce Center",
      "biography": "Hi! I am Chelsea Beard, Disability Resource Coordinator at Arapahoe Douglas Works! Workforce Center. I started at ADWorks! as a Career Services Advisor working on the RESEA and TAA programs. I was very excited when the DEI grant came along and knew that being a DRC would be the perfect fit for me because I have a background in Special Education! \n\nWith the funds from the DEI grant, I hope to implement financial literacy and education programs to AD Works, as well as increase access to the workforce system for individuals with disabilities. ",
      "co-leaders": "Shannon Bishop, Julie Cook",
      "session": "Tuesday, Session 4",
      "location": "Ballroom B",
      "title": "Disability Employment Initiative: An Innovative Approach to Working with Individuals with Disabilities",
      "objective": "1. Creating Seamless, Customer-Focused American Job Centers \n2. Delivery of Financial Services to SSA Disability Beneficiaries \n3. Collaboration with Businesses and Employers ",
      "audience": "Faculty, Partners",
      "abstract": "Learn about the Disability Employment Initiative Grant (DEI), and how you can implement key strategies in order to better support adults with disabilities. Colorado has been awarded the eighth round of funding for this grant in Arapahoe/Douglas, Denver, and El Paso/Teller counties. The purpose of the grant is to create sustainable systems and supports to improve the education, training, and employment outcomes of adults with disabilities. DEI focuses on making career pathways for adults with disabilities more inclusive and accessible. DEI is not a program, and is instead an initiative, that enhances our ability to serve adults with disabilities. The focus of DEI is to sustain practices long after the grant sunsets in September 2020. This session will touch upon core DEI strategies, including increasing programmatic accessibility, engaging businesses and employers to overcome hiring barriers, and collaborating with various community partners. ",
      "strand": "Workforce Development"
    },
    {
      "name": "Donna Kapp",
      "vendor": "No",
      "job-title": "Coordinator, Academic Transitions",
      "employer": "FSI/Community College of Denver",
      "biography": "Donna discovered her passion for adult education while volunteering at EGTC almost 15 years ago. Since then, she has earned a Certificate in English Language Teaching to Adults (CELTA) and a Master’s degree in Adult Education. She’s taught ABE, community and college level ESL, including Business English in Mongolia, managed training programs for refugees, and written contextualized curriculum for adults transitioning into careers and college-level studies. Topics she is currently exploring include experiential learning, growth mindset, and student success and retention strategies. ",
      "co-leaders": "none",
      "session": "Tuesday, Session 4",
      "location": "Ballroom D 1",
      "title": "Learning is Hard: Growth Mindset in Adult Education",
      "objective": "- Discuss the concept of growth mindset and its impact on student persistence.\n- Develop strategies to build a classroom environment that enhances student retention and persistence. \n- Take away at least one classroom-ready growth mindset activity.\n",
      "audience": "Faculty, Admin",
      "abstract": "Growth Mindset is the new buzzword! What’s it all about? Let’s explore the concept and consider how we can strengthen our students’ educational resilience by building a growth mindset environment in our classrooms. Takeaways will include at least one classroom-ready growth mindset activity for immediate use. ",
      "strand": "Best Practices, Diverse Learners, Evidence & Research to Practice"
    },
    {
      "name": "Sarah Wilkins",
      "vendor": "Yes",
      "organization": "Kentucky Educational Television (KET)",
      "website": "https://www.ket.org/",
      "twitter": "@KET",
      "facebook": "https://www.facebook.com/KET",
      "job-title": "Director, Adult Education and Workforce Training",
      "employer": "KET",
      "biography": "Dr. Sarah Wilkins is the Director of Adult Education and Workforce Training at Kentucky Educational Television (KET). In this position, she is charged with overseeing the development, management, evaluation, and promotion of KET’s adult education endeavors, both in Kentucky and nationally. Before joining KET, Wilkins spent over 20 years as a teacher and administrator in postsecondary institutions. She holds bachelor’s and master’s degrees in elementary education and a doctorate from the University of Kentucky in Educational Policy Studies and Evaluation.",
      "co-leaders": "none",
      "session": "Tuesday, Session 4",
      "location": "Bentley upstairs",
      "title": "Online Tools for Test and Work Prep ",
      "objective": "Participants will create free accounts in PBS LearningMedia and leave the session armed with information and tools to access over 100,000 free resources found in this online repository. You'll receive a list of workplace-specific folders already created to get you started! Participants will also receive a two-week free trial of Fast Forward, KET’s online study system for the GED®, HiSET® and TASC tests, as well as access to a sample of Workplace Essential Skills, KET’s online study system offering language arts and math lessons contextualized to workplace sectors.",
      "audience": "Faculty, Admin",
      "abstract": "In this session, participants will learn how to find videos, lesson plans, interactives, and more in PBS LearningMedia, an online repository of over 100,000 classroom resources. You'll also learn about Fast Forward and Workplace Essential Skills, KET’s online study systems for high school equivalency tests and contextualized workplace prep.",
      "strand": "Workforce Development, Vendor/Business"
    },
    {
      "name": "Stephanie Lindberg",
      "vendor": "No",
      "job-title": "Learning Specialist",
      "employer": "Community College of Denver- Foundational Skills Institute",
      "biography": "Stephanie Lindberg has been working in adult education for the last eight years. She currently teaches HSE classes at the Community College of Denver and college composition at Pikes Peak Community College. ",
      "co-leaders": "none",
      "session": "Wednesday, Session 5",
      "location": "Ballroom A",
      "title": "Teaching Teachers How to Tech",
      "objective": "Participants will learn: best practices for effective technology use in the classroom and beyond; how to identify effective technology for your students; ways to increase your own tech abilities.",
      "audience": "Faculty",
      "abstract": "Do you want to use technology, and don't know how? Are you overwhelmed by the number of websites that offer OER (open educational resources)? Are you unfamiliar with using some aspects of technology? Digital literacy is important for all students, but if you struggle with integration of technology, this session is for you! We will discuss some best practices for effective technology use in the classroom (and beyond), provide ways to identify effective technology for your students, and learn about ways to increase your own tech abilities. Come ready to learn about technology! Access to the internet will be helpful, but not required.",
      "strand": "Best Practices, Digital Literacy"
    },
    {
      "name": "Valerie M. Gantzler",
      "vendor": "No",
      "job-title": "Coordinator, Accelerated Pathways to Success",
      "employer": "Community College of Aurora",
      "biography": "Valerie Gantzler is the Accelerated Pathways to Success program coordinator at the Community College of Colorado (CCA). The program provides a bridge for students preparing for certificate programs, offers tutoring throughout the program, and assists students in obtaining employment post-graduation. Valerie has worked at CCA for three years in Colorado Adult Education and Literacy grant-funded programs and has spent over ten years in adult education. Due to her combined passion for teaching and data she also acts as the system administrator for LACES, TABE DRC, and Salesforce databases. ",
      "co-leaders": "Anne Petti",
      "session": "Wednesday, Session 5",
      "location": "Ballroom B",
      "title": "Who’s Your Data? Part II",
      "objective": "- Understand National Reporting System Measures: Attendees will gain an understanding of NRS measures and where Colorado is in the national ranking of achieving these measures. \n- Utilize LACES to provide you with the data your program needs: A brief overview of LACES and how to utilize the various views in order to determine where your program stands at any point in time without having to run fiscal year summaries. \n- Recognize the importance of messaging when testing: Since we can't get around pre and post testing, how to we make it more palatable and valuable for instructors and students? ",
      "audience": "Faculty, Admin, Partners",
      "abstract": "This presentation will provide information on the importance of National Reporting System (NRS) data and how the national database (via) LACES determines the primary goals of the AEFLA program: total number of NRS fundable students and percentage of learners who made measureable skills gains. The presentation will discuss how the Community College of Aurora (CCA) uses data from LACES to monitor these goals. The presentation will also discuss how messaging around pre and post-testing has helped increase outcomes.",
      "strand": "Effective use of Data"
    },
    {
      "name": "Cedric Lindsay",
      "vendor": "No",
      "job-title": "Student Success Coach",
      "employer": "The Learning Source",
      "biography": "Being welcomed into The Learning Source as Student Success Coach, Cedric has experience in K-12 education, Colorado Community College Systems, and Adult Education. Previously with the Adams 14 Adult Learning Center, he taught all levels of adult education and worked to further career services through developing business relationships, resume preparation, and creating student-centered workshops. Most recently, working for The Learning Source, building connections with community leaders and businesses while helping adult students increase persistence and discover their potential.",
      "co-leaders": "n/a",
      "session": "Wednesday, Session 5",
      "location": "Ballroom D 1",
      "title": "Growth Mindset",
      "objective": "1.) How do we praise students?\n2.) How do we react to mistakes?\n3.) Tie achievement to effort rather than talent",
      "audience": "Students, Faculty, Admin",
      "abstract": "Dr. Carol S. Dweck has pioneered some of the most influential research on the concept of Growth Mindset - the influence of the way in which students are praised and interacted with that can either greatly increase/decrease persistence. As a person's outlook can change, their concept of what is possible for them can change, too. Our question now becomes: How do we use this methodology and concept to better serve adult learners? Attend this session to become more familiar with Growth/Fixed Mindsets and how student's perceptions of their mistakes and accomplishments affect their willingness to persist. ",
      "strand": "Evidence & Research to Practice"
    },
    {
      "name": "Talya Clay",
      "vendor": "Yes",
      "organization": "National Geographic Learning",
      "website": "https://ngl.cengage.com/search/showresults.do?N=200+4294918395",
      "twitter": "@NatGeo",
      "facebook": "https://www.facebook.com/ELTNGLUnitedStates",
      "job-title": "SENIOR EDUCATIONAL SALES CONSULTANT",
      "employer": "National Geographic Learning/Cengage Learning",
      "biography": "Talya Clay (CELTA certified) has been dedicated to language learning since 1999 in a variety of settings including public schools and libraries as well as private language schools and companies. Her love of language and culture have taken her to Paraguay, Spain, and Brazil for extended stays. She is proud to be raising bilingual daughters in her own Brazilian Portuguese language lab in Seattle.",
      "co-leaders": "N/A",
      "session": "Wednesday, Session 5",
      "location": "Bentley upstairs",
      "title": "Preparing Students for Success in the 21st Century with authentic National Geographic content",
      "objective": "1. Participants will explore concise Grammar instruction to assure adult learners understand basic structures of English\n2. Participants will see how updated academic, workforce and civics content in the 3rd edition of English in Action meet the goals set forth in WIOA\n3. Participants will learn how to use authentic content effectively including TED Talks\n",
      "audience": "Faculty",
      "abstract": "How can you prepare adult ESL students for work and academic readiness while keeping them engaged and motivated? English in Action is a standards-based, integrated language learning program featuring authentic National Geographic content. Learners will improve their English proficiency while learning 21st century skills for further education or career pathway.",
      "strand": "College & Career Transitions, Digital Literacy, Workforce Development"
    },
    {
      "name": "Debbie Goldman",
      "vendor": "No",
      "job-title": "Teacher Trainer",
      "employer": "Intercambio Uniting Communities",
      "biography": "Debbie Goldman has over 30 years of experience teaching English to students of all ages and levels. She is currently in charge of teacher training at Intercambio Uniting Communities, where she develops and delivers both pre and in-service training to about 250 volunteers each year. She is a certified trainer for the SIT TESOL Certificate course and has trained teachers both abroad and in the US.\nDebbie has a BS in Spanish and Linguistics from Georgetown University as well as an MA in TEFL.\n",
      "co-leaders": "no co-leaders",
      "session": "Wednesday, Session 6",
      "location": "Ballroom A",
      "title": "Expanding Your ESL Toolkit",
      "objective": "Participants will leave this session with several easy to implement ideas using everyday materials that will increase student engagement in ESL classes. Ideas for pronunciation, grammar and speaking practice will be demonstrated. Additionally, creative methods for getting feedback will be offered.",
      "audience": "Faculty",
      "abstract": "What’s in your teaching toolkit? What are the items you can take to every class and use in multiple ways? Both novice and experienced teachers may benefit from this hands-on session where participants will experience activities that they can immediately implement in their ESL classes. New uses for items such as flashcards, magazines, and household objects will be explored in order to increase student engagement. Ideas for grammar, pronunciation, and speaking activities and games will be demonstrated. Creative ideas for getting feedback will also be presented. ",
      "strand": "Best Practices"
    },
    {
      "name": "George O'Clair",
      "vendor": "No",
      "job-title": "Workplace Education Director",
      "employer": "Cargill/MCC",
      "biography": "I have come from the trades and have built the successful IEMM program at MCC.",
      "co-leaders": "Trade teachers, Kevin Cruse, Aaron Skubal, Tim Grauberger, ",
      "session": "Wednesday, Session 6",
      "location": "Ballroom B",
      "title": "Trade classes all students know this before entering into class.",
      "objective": "This will be a panel of various trade teachers to inform ELA and HSE teachers and directors what is needed for the student to be successful in their class. What level of math, english, listening, and reading from the students.",
      "audience": "Faculty, Admin, Partners",
      "abstract": "The participants of this session be able to ask questions to tradesman. This will be a panel of various trade teachers to inform ELA and HSE teachers and directors what is needed for the student to be successful in their class. What level of math, english, listening, and reading from the students.",
      "strand": "College & Career Transitions, Workforce Development"
    },
    {
      "name": "Marsea Wynne",
      "vendor": "No",
      "job-title": "Accelerated Program Navigation Coordinator",
      "employer": "Community College of Denver",
      "biography": "Marsea helps adult learners navigate the Accelerated career pathways program for the Foundational Skills Institute (FSI) at CCD. In 2015 she was tasked with implementing the CCD State Adult Education & Literacy grant, which served as a pilot for FSI's current integrated education and training program design. She is actively involved in the adult education community, along with workforce and community service organizations. She enjoys collaborating with navigators and instructors from multiple adult education programs.",
      "co-leaders": "Navigators",
      "session": "Wednesday, Session 6",
      "location": "Ballroom C",
      "title": "Career Pathways Navigators Meeting",
      "objective": "Venue for navigators to come together and share ideas:\n\n- What are some successful strategies for career pathways navigation?\n- How do we help students identify and select viable careers?\n- Are there standardized tools we should all be using?\n- How do we measure success in career pathways navigation?\n- Should we develop a centralized list of navigation resources?\n- Or is it sufficient to leverage existing resource lists like AuntBertha.com?\n- How can we avoid duplication of services for referrals?\n- What challenges do we all have in common? \n- Are there any ongoing PD resources for navigators?",
      "audience": "Admin",
      "abstract": "Calling all adult education career pathways navigators for an open discussion! If you are helping students plan post-secondary education and/or training while they balance life, work, and school, please consider coming together at CAEPA to share successes and challenges. All navigators and program coordinators are welcome, and should expect to come away with helpful ideas from colleagues. We will discuss reestablishing a Navigators Group to participate in the AE Partners collaborative.",
      "strand": "Best Practices, College & Career Transitions, Workforce Development"
    },
    {
      "name": "Leann Kaiser",
      "vendor": "No",
      "job-title": "Assistant Professor",
      "employer": "Colorado State University",
      "biography": "Leann Kaiser holds a Ph.D. in adult and post-secondary education from the University of Wyoming, a M.S. from Arizona State University, and a B.S. from the University of Wyoming. Leann's teaching and research interests encompass adult teaching and learning theory, learning transfer, experiential learning, and distance student educational experiences. Leann has taught in the fields of adult education and outdoor education at the post-secondary level since 2001. Her other professional experience includes work in natural resource education programming and public land management.",
      "co-leaders": "none",
      "session": "Wednesday, Session 6",
      "location": "Ballroom D 1",
      "title": "Experiential Learning Step By Step: How to Plan and Facilitate Using This Powerful Teaching Method",
      "objective": "1. Participants will be introduced to the five tenets of experiential learning and when/why to use it.\n2. Participants will engage in experiential learning activities and recognize how/were the five tenets are present in these activities.\n3. Participants will be guided in a process to help them create an experiential learning lesson for use in their own professional context.",
      "audience": "Students, Faculty, Admin, Partners",
      "abstract": "Experiential learning is a popular concept and many adult educators find value in using it as a teaching method. But successfully planning and facilitating experiential learning takes skill, practice, and knowledge.\n\nDuring this session the presenter will explain the five tenets of experiential learning. When and why experiential learning can be an effective facilitation method to use will also be explored. During the session, participants will have the opportunity to actually engage in experiential learning activities in order to understand, first-hand, how the five tenets can be applied in practice. Participants will also have the opportunity to begin designing their own experiential learning activity that they can utilize with learners in their own professional teaching settings.",
      "strand": "Best Practices, Evidence & Research to Practice"
    },
    {
      "name": "Dorothea Steinke",
      "vendor": "No",
      "job-title": "owner",
      "employer": "NumberWorks LLC",
      "biography": "Dorothea Steinke is an adult numeracy specialist with over 10 years experience teaching math to adults. She presents frequently at local/regional/national conferences, including a guest presentation on LINCS. She currently serves on the board of the Literacy Coalition of Colorado and is the Colorado representative of the Adult Numeracy Network.",
      "co-leaders": "none",
      "session": "Wednesday, Session 7",
      "location": "Ballroom A",
      "title": "How Big Is It?",
      "objective": "1) Gain a better physical sense of Power of 10 relationships (positive and negative exponents) in place value.\n2) Learn the vocabulary of very small numbers and their size relationships. ",
      "audience": "Students, Faculty",
      "abstract": "We measure things to know how big or small they and to know where they are. We count by “10s” (addition) and “groups of 10” (multiplication) and “groups of groups of 10” (exponents) to make the numbers more manageable when we write them. Adult learners need to understand the size relationships of exponents for science and math tests, and even more so when working in medicine, engineering and other fields. This workshop will provide examples for teaching how exponents change the size of numbers. It will also introduce the vocabulary of very small numbers.",
      "strand": "Best Practices, College & Career Transitions, Workforce Development"
    },
    {
      "name": "Anne Petti",
      "vendor": "No",
      "job-title": "Director, Center for Workforce Development",
      "employer": "Community College of Aurora",
      "biography": "Ms. Petti graduated with an M.A. in TESOL from Michigan State University. She has taught ESL in the U.S., as well as overseas. For over 5 years, she worked as a Manager in the Adult Education program at Pima Community College in Tucson, AZ. In her current position as Director of the Center for Workforce Development at the Community College of Aurora, she oversees the High School Equivalency (GED), Community ESL, Citizenship, and Bridge programs. In addition to being a language teacher, she is also a language learner. Over the years, she has become proficient in four languages besides English.",
      "co-leaders": "Valerie Gantzler",
      "session": "Wednesday, Session 7",
      "location": "Ballroom B",
      "title": "A Tale of Two Career Pathway Programs",
      "objective": "- Learn about the two Career Pathway models CCA has implemented\n- Learn about some of the challenges the program has faced, and how they arrived at effective practices\n- Hear about specific best practices that have been developed in areas such as student screening and intakes, working with partners, implementing wrap-around supports, messaging to students, and building relationships with internal and external partners, as well as with students\n- Learn about the challenges and successes the program has experienced in coordinating between the non-credit and credit sides of the college\n- Hear about student success stories!",
      "audience": "Faculty, Admin, Partners",
      "abstract": "This presentation will give an overview of the Career Pathways programs that have been implemented at the Community College of Aurora, and lessons that have been learned. Specifically, the presenters will discuss best practices they have developed around vetting participants, working with partners, messaging to students, the value of wrap-around supports, and the importance of relationship-building, and share some student success stories!",
      "strand": "Best Practices"
    },
    {
      "name": "George O'Clair",
      "vendor": "No",
      "job-title": "Workplace Education director",
      "employer": "Cargill/MCC",
      "biography": "I worked with 14 different corporations to find out what was needed in in their company and how the education system could help. I work directly with Cargill's training specialist to develop classes to meet the needs of the public. ",
      "co-leaders": "Brenda Zion",
      "session": "Wednesday, Session 7",
      "location": "Ballroom C",
      "title": "Education, Working inside a corporation.",
      "objective": "Benefiting the public, the corporation, classes that work.",
      "audience": "Faculty, Admin, Partners",
      "abstract": "The participants will see the making of Workplace Education working on site of a plant. They will see what benefits come from working so close to a corporation and how education is changing to accommodate the workforce.",
      "strand": "College & Career Transitions, Workforce Development"
    },
    {
      "name": "Tara Keily",
      "vendor": "Yes",
      "organization": "Aztec Software",
      "website": "http://www.aztecsoftware.com/",
      "twitter": "@aztecsoftware",
      "job-title": "Regional Account Manager",
      "employer": "Aztec Software",
      "biography": " Tara Keily has been with Aztec Software since July 2016. Previously to joining the Aztec team, she has been serving the education market for over 15 years. During her tenure in the education market, she has worked with the K-12 division, workforce development, adult basic education and the private sector as an educational sales consultant. She joined Aztec Software because she has a passion for adult education and believes the future success of the adult student in the workforce depends on the student being familiar with computer and technology. ",
      "co-leaders": "Jonathan Blitt",
      "session": "Wednesday, Session 7",
      "location": "Bentley upstairs",
      "title": "Practice for Knowledge Acquisition Towards GED Success",
      "objective": "It doesn't matter what subject you are teaching, differences in students’ performance are affected by how much they engage in deliberate practice and preparation. Deliberate practice occurs when an individual intentionally repeats an activity in order to improve performance. Come learn how Aztec Software’s Continuum of Learning series provides students with the goal of transferring knowledge that can purposely lead to improved learning performance, especially with the GED Test as we unveil GED Flash. Participants will be able to leave with their own demo log-in account. ",
      "audience": "Faculty, Admin",
      "abstract": "It doesn't matter what subject you are teaching, differences in students’ performance are affected by how much they engage in deliberate practice and preparation. Deliberate practice occurs when an individual intentionally repeats an activity in order to improve performance. Come learn how Aztec Software’s Continuum of Learning series provides students with the goal of transferring knowledge that can purposely lead to improved learning performance, especially with the GED Test as we unveil GED Flash. ",
      "strand": "College & Career Transitions, Digital Literacy, Evidence & Research to Practice"
    },
    {
      "name": "Alexandra Soto",
      "vendor": "No",
      "job-title": "Outreach & Adult Education Program Coordinator",
      "employer": "Spring Institute for Intercultural Learning",
      "biography": "Alexandra Soto is the Outreach & Adult Education Program Coordinator for Spring Institute for Intercultural Learning. She has been providing quality services to adult learners for four years and has helped to improve program retention and engagement, among other measures. Alexandra has provided outreach and marketing for small business, including website management, event outreach, and development of marketing strategies. Part of her role with Spring Institute includes managing the Facebook page, preparing monthly newsletters, and developing annual reports and other promotional materials.",
      "co-leaders": "None",
      "session": "Wednesday, Session 8",
      "location": "Ballroom A",
      "title": "Engaging Learners thru Social Media & Free Marketing Tools",
      "objective": "(1) Participants will be able to develop a basic social media plan that includes identifying an audience, objectives, content and metrics.\n(2) Participants will be able to describe how online tools (e.g. Facebook) can be used to engage learners, in and outside of the classroom.\n(3) Participants will be able to use marketing tools (e.g. MailChimp) to boost engagement, share resources and successes, and improve outcomes.\n",
      "audience": "Faculty, Admin",
      "abstract": "In business, having an online presence is fundamental. It cultivates a wider audience, improves accessibility and builds trust. So how can you harness this awesome power to engage your learners (or other stakeholders) and even improve outcomes? This presentation will provide an overview of social media and free marketing tools that can be used by individuals, programs or organizations to build their online communities. Participants will get a head-start on developing a basic social media plan for their classroom or program; and participants will leave this session with practical uses for social media and innovative ways of using common technologies (such as Google)!",
      "strand": "Advocacy (Emphasis Educate and Elevate), Digital Literacy"
    },
    {
      "name": "Ellen Klement",
      "vendor": "No",
      "job-title": "HSE Instructor",
      "employer": "Foundational Skills Institute @ CCD",
      "biography": "Ellen was a counselor before embarking on a teaching career. Completing her MA in Somatic Psychology in 1998, Ellen uses the skills she learned working with trauma survivors to help students overcome their anxieties about learning to empower them towards successful outcomes in the classroom and life. Starting out as an ESL volunteer in 2001, Ellen has been a classroom teacher for the past eight years. She loves the innovation and flexibility required to address all the different brains within her classroom.",
      "co-leaders": "None",
      "session": "Wednesday, Session 8",
      "location": "Ballroom B",
      "title": "Emotions in Motion",
      "objective": "Attendees will learn body cues based on Somatic Psychology to mirror and validate the student's internal experience. Attendees will learn next steps for moving the student to another emotional or mental mindset. ",
      "audience": "Faculty, Admin",
      "abstract": "Learning is both a mental and physical activity at the same time. By becoming more aware of what may be happening internally for students within your classroom, learn how to assist them with finding a new way of relating to their challenges and beliefs. ",
      "strand": "Diverse Learners"
    },
    {
      "name": "Leann Kaiser",
      "vendor": "No",
      "job-title": "Assistant Professor",
      "employer": "Colorado State University",
      "biography": "Drs. Leann Kaiser, Kalpana Gupta, and Jill Zarestky are Assistant Professors at Colorado State University in the Adult Education and Training master's degree specialization. They have varying areas of expertise in the field of adult education, including adult teaching and learning theory, creating inclusive learning environments, online learning, mindfulness, community based learning, and STEM education.",
      "co-leaders": "Kalpana Gupta, Jill Zarestky",
      "session": "Wednesday, Session 8",
      "location": "Bentley upstairs",
      "title": "I'm Not a “Theory” Person: Practical Ideas and Applications to Help YOU Use Theory to Improve Your Teaching",
      "objective": "1. Participants will be introduced to major theoretical foundations on how adults learn and how to facilitate learning.\n2. Participants will share their own questions and issues related to teaching adults and apply adult learning theory to address those items.\n3. Participants will be given tools to apply what they have learned during the session to improve their own teaching practice.",
      "audience": "Students, Faculty, Admin, Partners",
      "abstract": "Whether you have been teaching adults for 2 months or 20 years, there is always more we can learn to be effective educators. For many adult educators, what we have learned has been gained “on the job” and we may have little formal background on how or why what we do works, nor ideas based on solid evidence on how to improve in areas where we struggle. Luckily, there is a depth of knowledge about how adults learn and how to facilitate that learning.\n\n\nDuring this session the presenters will share the major academic foundations of adult education. The presenters are professors of adult education and work in a university graduate program, teaching adult education practitioners. The information they present will be drawn from their knowledge of theoretical underpinnings and how application of those can lead to improved instructional methods and design. During this session the knowledge and experience of the participants will be utilized as their questions, struggles, and areas in which they want to improve will form the basis for the content presented. These issues presented by the participants will be directly addressed through the lens of adult education theory and foundations to assist participants to both understand the importance of these foundations and also to use them to improve their own teaching practices.",
      "strand": "Best Practices, Evidence & Research to Practice"
    }
  ],
  "vendors": [
    {
      "email": "martin.l@burlingtonenglish.com",
      "phone": "832-301-2851",
      "sponsorship-tier": "Vendor",
      "nonprofit": "No",
      "vendor": "Martin Loa",
      "title": "Customer Manager",
      "organization": "Burlington English",
      "website": "https://www.burlingtonenglish.com/",
      "twitter": "@BurlingtonEng",
      "facebook": "https://www.facebook.com/BurlingtonEng",
      "description": "BurlingtonEnglish offers a unique program for English language acquisition. It combines face-to-face classroom activities with any time-anywhere access to state-of-the-art online interactive courses. With the BurlingtonEnglish SpeechTrainer®, students effectively improve their pronunciation and comprehensibility, giving them the confidence to communicate successfully in any situation."
    },
    {
      "email": "george.oclair@morgancc.edu",
      "phone": "970-768-0003",
      "sponsorship-tier": "Vendor",
      "nonprofit": "Yes",
      "vendor": "George O'Clair",
      "title": "Workplace Director",
      "representatives": "Benda Zion, Kevin Cruse, Aaron Skubal, Tim Grauberger",
      "organization": "Cargill, Workplace Education and Trades",
      "website": "http://www.morgancc.edu ",
      "twitter": "@MorganCC",
      "description": "MCC Workplace and Cargill Meat Solutions has a collaboration for 24 years to create a pathway for students to fill the workforce demands. We have created a pathway in some trades."
    },
    {
      "email": "dstauffer@ccu.edu",
      "phone": "970.461.5204",
      "sponsorship-tier": "Vendor",
      "nonprofit": "Yes",
      "vendor": "Darris Stauffer",
      "title": "Regional Enrollment Director ",
      "representatives": "David Silva, Christian Temby ",
      "organization": "Colorado Christian University ",
      "website": "https://www.ccu.edu/ccu/online/",
      "linkedin": "https://www.linkedin.com/school/colorado-christian-university/",
      "twitter": "@CCU_CAGS",
      "facebook": "https://www.facebook.com/CCUCAGS",
      "description": "Thousands of adult students have earned accredited degrees from Colorado Christian University without ever setting foot on campus. You can login from any location to view your instructors’ presentations, participate in discussions with your classmates, and submit your weekly assignments.\nWhether you routinely travel for work or have an irregular schedule, your CCU Online courses go with you. As a student, you can log into your courses from anywhere Internet access is available. There are many benefits of earning a degree online, including taking courses at your own pace, having access to a community of learners just like you, and being able to find class resources at your fingertips. \nFor additional questions, visit our online degree FAQs page. You can also check out our online learning portal, Blackboard. If the flexibility of an online degree sounds like a good fit for you, take a look at our online adult degree programs below.\n"
    },
    {
      "email": "ctraudt@datarecognitioncorp.com",
      "phone": "512-981-9123",
      "sponsorship-tier": "Vendor",
      "nonprofit": "No",
      "vendor": "Christina Traudt",
      "title": "Assessment Solutions Representative",
      "organization": "DRC Data Recognition Corp",
      "website": "http://www.datarecognitioncorp.com",
      "twitter": "@DRCEducation",
      "facebook": "https://www.facebook.com/Data-Recognition-Corporation-435328789823911/",
      "description": "Data Recognition Corp offers the new TABE 11/12 tests and TASC in Colorado. "
    },
    {
      "email": "islutzky001@ets.org",
      "phone": "609-683-2202",
      "sponsorship-tier": "Vendor",
      "nonprofit": "Yes",
      "vendor": "Adam Springwater",
      "title": "Senior Manager",
      "organization": "ETS HiSET",
      "website": "https://hiset.ets.org/",
      "twitter": "@HiSET_ETS",
      "facebook": "https://www.facebook.com/ETSHiSET",
      "description": "In 2014, Educational Testing Service broke new ground in adult education with the HiSET® exam — an affordable, more accessible high school equivalency test option. Built on the College and Career Readiness Standards, the HiSET exam gives out-of-school youth and adults an opportunity to demonstrate their skills and earn a state-issued high school equivalency credential. The exam features paper- and computer-based formats, in English and Spanish. Now the fastest-growing exam on the market it has been adopted in more than 28 states and territories."
    },
    {
      "email": "elizabeth.lanphear@ged.com",
      "phone": "913-283-1021",
      "sponsorship-tier": "Vendor",
      "nonprofit": "No",
      "vendor": "LIz Lanphear",
      "title": "State Relationship Manager",
      "organization": "GED Testing Service",
      "website": "https://GED.com",
      "twitter": "@GEDTesting",
      "facebook": "https://www.facebook.com/GEDTesting/",
      "description": "We are GED Testing Service, the sole provider of the official GED test. We've helped over 20 million people attain their GED credential -- we are the only high school equivalency program that is recognized by 97% of employers and colleges nationwide. And we've been doing it for more than 75 years. GED Testing Service is focused on helping adults gain their high school equivalency diploma and change their lives for the better. Whether their goal is a new career, college or to climb the job ladder, our program is designed to help students develop the critical thinking skills and self- conﬁdence that will help them ﬂourish. We look at the GED as more than a credential: it is a tool to help adult learners develop the skills they will need to succeed across many careers and in higher education. GED students unlock career and educational opportunities and become role models both to their peers and the next generation of learners."
    },
    {
      "email": "swilkins@ket.org",
      "phone": "859-258-7109",
      "sponsorship-tier": "Vendor",
      "nonprofit": "Yes",
      "vendor": "Sarah Wilkins",
      "title": "Director, Adult Education and Workforce Training",
      "representatives": "Shanise Edwards",
      "organization": "KET (Kentucky Educational Television)",
      "website": "https://www.ket.org/",
      "twitter": "@KET",
      "facebook": "https://www.facebook.com/KET",
      "description": "For over 40 years, KET has been a provider of adult education study materials. Broadcast programs for GED® study began in 1975, followed by a GED® Study at Home program in 1984. \nWith the advent of the computer-based GED® test in 2014, and the introduction of HiSET® and TASC tests, KET once again provided relevant study materials for adult learners. In early 2014, KET launched Fast Forward, an online study system that prepares learners for the GED®, HISET®, and TASC high school equivalency tests. \nTo help meet the demand for skilled workers, KET has begun development of Workplace Essential Skills, an online, multi-course instructional system that combines expertise in workforce readiness content and effective curriculum development for today’s employees and employers.\nKET’s adult education content is used in all 50 states, U.S. territories, in federal and state correctional facilities, and by members of the military.\n"
    },
    {
      "email": "president@literacycolorado.org",
      "phone": "303-919-9242",
      "sponsorship-tier": "Vendor",
      "nonprofit": "Yes",
      "vendor": "Dorothea Steinke",
      "title": "Board chair",
      "organization": "Literacy Coalition of Colorado",
      "website": "https://literacycolorado.org/",
      "twitter": "@LiteracyCC",
      "facebook": "https://www.facebook.com/Literacy-Coalition-of-Colorado-251935441595829",
      "description": "Our Mission: To ensure that adult education is accessible to all who seek it.\n\nThe Literacy Coalition began in the 1980s as a grassroots community network in Jefferson County. Since its inception, the Literacy Coalition has contributed significantly to the field by recruiting, placing and training volunteer tutors. The new online MAPS help people find classes and allow volunteers to find opportunities. The Literacy Coalition continues to work to connect adult education organizations in Colorado."
    },
    {
      "email": "george.oclair@morgancc.edu",
      "phone": "970-867-1575",
      "sponsorship-tier": "Vendor",
      "nonprofit": "Yes",
      "vendor": "George O'Clair",
      "title": "Program Director",
      "representatives": "Brenda Zion, Jesus, Rachel ",
      "organization": "MCC Workplace Education at Cargill",
      "website": "https://www.morgancc.edu/programs/workplace-education/",
      "twitter": "@MorganCC",
      "description": "The Workplace Education Program exists as a partnership between Morgan Community College and Cargill in Fort Morgan. Employees of the plant and their family members attend class before or after their regular shift at the plant"
    },
    {
      "email": "dec1216@msn.com",
      "phone": "602-349-2835",
      "sponsorship-tier": "Vendor",
      "nonprofit": "Yes",
      "vendor": "Philip Suriano",
      "title": "MPAEA President",
      "organization": "Mountain Plains Adult Education Association",
      "website": "https://mpaea.wildapricot.org/",
      "twitter": "@MPAEA",
      "facebook": "https://www.facebook.com/MPAEA",
      "description": "The Mountain Plains Adult Education Association serves members in a nine-state region. The original charter and founding policies were developed in 1945. The four original states were Colorado, New Mexico, Utah and Wyoming. In 1961, Arizona, Idaho and Nevada joined. Montana became the eighth state in 1988. North Dakota became the ninth state in 2014. The Mission of MPAEA is to support and promote lifelong learning in the Mountain Plains Region. In order to achieve its mission, the association promotes and provides professional development opportunities for adult educators, publishes and distributes relevant information about lifelong learning though its journal and newsletter, and supports and strengthens member associations within the states of the region. A yearly regional conference through a partnership with member states also presents best practices, showcases innovative approaches and the latest efforts to better serve lifelong learners across the region. Scholarship opportunities as well as yearly award recognition in the region are additional ways MPAEA strives to support members making a difference in the field of lifelong learning. https://mpaea.wildapricot.org"
    },
    {
      "email": "talya.clay@cengage.com",
      "phone": "206-604-6777",
      "sponsorship-tier": "Vendor",
      "nonprofit": "No",
      "vendor": "Talya Clay",
      "title": "SENIOR EDUCATIONAL SALES CONSULTANT",
      "representatives": "N/A",
      "organization": "National Geographic Learning",
      "website": "https://ngl.cengage.com/search/showresults.do?N=200+4294918395",
      "twitter": "@NatGeo",
      "facebook": "https://www.facebook.com/ELTNGLUnitedStates",
      "description": "National Geographic Learning and English Language Teaching\nNational Geographic Learning’s mission is to bring the world to the classroom and the classroom to life. With our English language programs, students learn about their world by experiencing it. Through our partnerships with National Geographic and TED, they develop the language and skills they need to be successful global citizens and leaders."
    },
    {
      "email": "manderson@proliteracy.org",
      "phone": "800-448-8878",
      "sponsorship-tier": "Vendor",
      "nonprofit": "Yes",
      "vendor": "Ken Barr",
      "title": "Educational Sales Consultant",
      "organization": "New Readers Press",
      "website": "http://www.newreaderspress.com",
      "linkedin": "https://www.linkedin.com/showcase/new-readers-press",
      "twitter": "@NewReadersPress",
      "facebook": "https://www.facebook.com/NewReadersPress",
      "description": "For over 50 years, New Readers Press has been helping adult learners make meaningful gains in basic reading, writing, and math skills. Our products have helped thousands of students achieve a high school equivalency diploma or pass the Citizenship Test. Whatever you adult learners or instructors need, New Readers Press has the solution. \n\nProceeds from the sales of New Readers Press materials support ProLiteracy and benefit literacy programs in the U.S. and around the globe."
    },
    {
      "email": "george.oclair@caepa.org",
      "phone": "970-768-0003",
      "sponsorship-tier": "Vendor",
      "nonprofit": "Yes",
      "vendor": "George O'Clair",
      "title": "Director",
      "representatives": "Zach Collins, trades panel",
      "organization": "Trades council ",
      "website": "http://www.caepa.org",
      "twitter": "@caepa_co",
      "facebook": "https://www.facebook.com/caepa.co",
      "description": "This table will be donated for the trades council to promote the trades at CAEPA for the adult educators."
    }
  ],
  "sponsors": [
    {
      "email": "receptionist@aztecsoftware.com",
      "phone": "800-273-0033",
      "sponsorship-tier": "Platinum",
      "nonprofit": "No",
      "vendor": "Tara Keily",
      "title": "Account Manager",
      "organization": "Aztec Software",
      "website": "http://www.aztecsoftware.com/",
      "twitter": "@aztecsoftware",
      "description": "Since its founding in 1980, Aztec Software has always been a pioneer using technology in the movement of improving lives through education and skill-building initiatives. Aztec has evolved extensively over the years, expanding its learning suite to include academic materials designed to develop educational excellence to building up soft skills and employability.\n \nOur learning solutions are designed to educate, empower and elevate adult learners towards success. These dynamic learning solutions effectively help to equip adults and non-traditional students with knowledge towards higher learning, exponentially improve career readiness and job performance, and ultimately help people realize their potential and achieve their goals. And with the introduction of LIFE SKILLS EDUCATION to the Aztec Learning System, individuals can acquire skills to better navigate life’s challenges, strengthen their core problem-solving abilities, and successfully learn how to get hired and stay hired through these insightful career and personal development booklets"
    },
    {
      "email": "membership@coabe.org",
      "phone": "315-935-4444",
      "sponsorship-tier": "Bronze",
      "nonprofit": "Yes",
      "vendor": "Laurie Kierstead-Joseph",
      "title": "Director, Adult Education Services Adult Basic Education for College & Career Pima Community College",
      "organization": "COABE",
      "website": "http://www.coabe.org",
      "twitter": "@COABEHQ",
      "facebook": "https://www.facebook.com/COABEHQ",
      "description": "The Coalition on Adult Basic Education (COABE) is organized to advance national and international adult education and literacy opportunities for all persons."
    },
    {
      "email": "hmorrison@paxenpublishing.com",
      "phone": "512-789-8240",
      "sponsorship-tier": "Bronze",
      "nonprofit": "No",
      "vendor": "Heather Morrison",
      "title": "Account Executive",
      "organization": "Paxen Publishing",
      "website": "https://www.paxenpublishing.com/",
      "twitter": "@PaxenPublishing",
      "facebook": "https://www.facebook.com/paxenpublishing",
      "description": "For over 30 years, we have been creating curriculum and online learning tools for adult education. Our approach and pedagogy have been developed specifically for learners who have struggled with conventional classrooms and traditional textbooks. With the addition of Steck-Vaughn adult education materials, Paxen addresses all of your learners’ needs and provides content solutions for adult basic education, high school equivalency test preparation, college readiness, career pathways and more."
    }
  ]
}
