[
  {
    "Timestamp": "2018-04-27T8:15:00-7:00",
    "Accepted": "Yes",
    "name": "John Spears",
    "employer": "Pikes Peak Library District",
    "job-title": "Chief Librarian & CEO",
    "email": "",
    "phone": "",
    "twitter": "https://twitter.com/ppld",
    "facebook": "https://facebook.com/PikesPeakLibraryDistrict",
    "title": "Untitled",
    "biography": "John Spears has been Chief Librarian & CEO of the Pikes Peak Library District (PPLD) since early 2016. Mr. Spears has nearly 20 years of experience working in urban, suburban, and rural libraries. Prior to joining PPLD, he served as the director of libraries in Salt Lake City (UT), Naperville (IL), and Joliet (IL).\n\nMr. Spears is a past president of the Library Leadership and Management Association (LLAMA) and was the 2015 Utah Librarian of the Year. He is active in PLA as a contributing editor to Public Libraries magazine and co-author of “Forward Thinking,” a column that explores trends in public librarianship. He believes that libraries act as a catalyst in the artistic, cultural, economic, and civic development of their communities, and that the strength of a library resides in the staff and the connections they form with those they serve.\n\nIn addition to his work in the library profession, John’s passions include serving those experiencing homelessness, working with young addicts to overcome their dependency and reach their full potential, and promoting and participating in the arts. Within his own community, he serves on the governing board of the Pikes Peak Continuum of Care and the boards of the Colorado Springs Youth Symphony Association, Cultural Office of the Pikes Peak Region, the Ithaka Land Trust and Downtown Partnership of Colorado Springs. He also enjoys traveling, cooking, and taking care of their three dogs with his partner, Brian."
  },
  {
    "Timestamp": "2018-04-27T12:00:00-7:00",
    "Accepted": "Yes",
    "name": "Danielle Ongart",
    "employer": "Colorado Department of Education",
    "job-title": "Director of the Office of Adult Education",
    "email": "",
    "phone": "",
    "twitter": "https://twitter.com/codepted",
    "facebook": "https://facebook.com/codepted",
    "title": "Introduction",
    "biography": "Danielle Ongart is the Director of the Office of Adult Education Initiatives at the Colorado Department of Education (CDE). The office oversees $8 million in federal and state grants to over 25 programs around the state.\n\nPrior to CDE, Danielle was an Obama Administration political appointee at the US Department of Education where she developed guidance and regulations for the Every Student Succeeds Act and oversaw the distribution of $1 billion in federal funds. Danielle worked as the Associate Director of Professional Learning Implementation in Denver Public Schools. In Denver, Danielle co-wrote the observation and professionalism framework that is part of the teacher growth and performance system for 5,000+ educators and developed the strategy to improve the quality and impact of professional learning. In 2011, she was a Research and Policy Analyst in the Colorado Department of Education’s Office of Dropout Prevention and Student Reengagement. Danielle began her work in education as an elementary and middle school teacher in the Washington Heights and Harlem neighborhoods of New York City, including as a founding teacher at New Heights Academy Charter School. Danielle holds a B.A. in Radio/TV/Film from Northwestern University and an M.S. in Teaching from Pace University.\n"
  }
]
